[
  {
    "name": "158CM CONCEPT STORE",
    "unit": "TM-038",
    "desc": "Get everything streetwear at 158CM Concept Store! This style forward clothing store offers an eclectic mix of local and international streetwear brands, allowing you to dress your best wherever you roam. Discover the latest brand collaborations and the hottest street style trends right here.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logomobile09Aug2023162803.jpg"
  },
  {
    "name": "4Fingers Crispy Chicken",
    "unit": "TM-040",
    "desc": "IF you've been looking for food choices that are tasty and wholesome, from a brand that's honest. Then 4FINGERS is here to take over. We're all about giving you great food. And we guarantee that once you've tasted our handbrushed crispy chicken, you'll be wondering how you could have gone for so long without it. Come by and succumb to 4FINGERS Crispy Chicken.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE20Jan2020122504.jpg"
  },
  {
    "name": "Bar.B.Q Plaza",
    "unit": "TM-028",
    "desc": "Bar B Q Plaza is best known for its unique, Mongolian-Japanese barbecue style. A memorable dining experience, you can enjoy a barbecue and steamboat meal all at once! The menu is well catered to individual meals or big family platters. However, the Thai brand has added a spin by introducing tangy dipping sauces that are insanely addictive. You will have to try this at least once to know what the hype is all about!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Oct2019224225.jpg"
  },
  {
    "name": "De Figurelab",
    "unit": "TM-015A",
    "desc": "Step into a playful realm of figurine collectibles! The world of DE FIGURELAB is diverse with an endlessly creative collection of art toys and figurines. Feast your eyes on iconic classics, one-of-a-kind creations, and limited-edition designer collaborations, then bring them home to start or expand your very own collection. This figurine store is a treasure trove of art toys waiting to be explored!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/DeFigure-Logo-Mobile29Mar2024172702.gif"
  },
  {
    "name": "Fun X Factory",
    "unit": "TM-004",
    "desc": "Spice up your adult life with something fun from FUN X FACTORY! This novelty store has over 2000 product reviews to help you choose the right toy for your needs. Whether you are looking for something for yourself or for you and your partner, you might just find it here. Visit the store to explore your options and leave feeling thrilled about what’s to come.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile28Apr2023163244.jpg"
  },
  {
    "name": "Glow House",
    "unit": "TM-024",
    "desc": "Revel in the hair pampering sessions of your dreams at Glowhouse! This is not your ordinary salon – it's dedicated to washes, blowouts, and styling that will have you feeling gorgeous and empowered. Turn your hair goals into reality! Step right in, take a seat, and experience top-notch hair services. Strut out of the salon feeling like an absolute boss babe.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/IMG_116806Jan2024160546.jpeg"
  },
  {
    "name": "Golden Screen Cinemas",
    "unit": "AT-3",
    "desc": "Power through blockbuster after blockbuster at Golden Screen Cinemas! This multiplex is currently the biggest in Johor Bahru and the second largest in Malaysia, boasting 18 halls equipped with plush seating, multi-dimensional Dolby Atmos® audio surround technology, 4DX, and much more! If that’s not enough, go lux with private halls. The latest international and local screenings will come into life before your eyes every single time, so just sit tight and enjoy the movie!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO14Nov2019085027.jpg"
  },
  {
    "name": "HEYTEA",
    "unit": "TM-016",
    "desc": "Real premium teas, bold authentic flavours! HEYTEA serves handcrafted tea beverages of the finest quality made with real ingredients. From a humble store in a small alley in Jiangbianli, HEYTEA has grown its empire of tea beverages made with fresh milk and fruits, premium teas, and natural cane sugar, infusing new life into traditional teas. If you’re not already a fan, try its best-selling Cheese Grape Boom or Supreme Brown Sugar Bobo Milk, and find out why so many love it!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Heytea Mobile11Oct2024162932.jpg"
  },
  {
    "name": "Ichiban Ramen",
    "unit": "TM-003",
    "desc": "Japanese ramen specialist that brings authentic Japanese cuisine to everyone at affordable pricing in delightfully cozy environment. From a single shop, Ichiban Ramen has grown into a household name for quality Japanese food with branches all over Malaysia. With materials sourced directly from Japan for a wide variety of delicious dishes, it’s the place of choice for great Japanese food!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Oct2019221426.gif"
  },
  {
    "name": "Jigsaw Puzzle World",
    "unit": "TM-032",
    "desc": "The jigsaw enthusiast could while away hours in this store, and with the wide range of designs in 2D and 3D, glow in the dark, and more, we can definitely see why!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Mar2020085655.jpg"
  },
  {
    "name": "Johor Bahru Blood Donation Suite",
    "unit": "TM-021",
    "desc": "Your blood can help to save a life. You can now donate blood to those in need at Pusat Darah Negara (PDN), a blood transfusion service centre established under the Ministry of Health. PDN collects blood and blood component production and supplies them to general as well as private hospitals. Donate blood and make a difference today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/pusat-darah-negara_logo_desktop01Oct201516294707Jun2021142531.jpg"
  },
  {
    "name": "Ke Ren Lai",
    "unit": "TM-029&030",
    "desc": "Previously known as Guest Restaurant, KeRenLai is a well established Hakka restaurant. Regular customers come back for the authentic flavours and the fresh ingredients used to prepare each dish. If you’re looking for a new restaurant to treat your family to, KeRenLai provides you a comfortable atmosphere and delicious food.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Oct2019231510.jpg"
  },
  {
    "name": "KF Kiddy Circuit",
    "unit": "TM-008",
    "desc": "Let your young racers “Feel-The-Rush” in the first one-of-a-kind indoor go-kart circuit, KF Kiddy Circuit! Perfect place for family outing, KF Kiddy Circuit karts are safely designed for young ones to enjoy the adrenaline of racing, with precaution measures such as safety belt, water-filled track barriers, speed and height limit being placed. They will also be able to learn the basics of driving while being behind the wheel of these electric kids kart.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile08Nov2022174021.jpg"
  },
  {
    "name": "Kiddytopia",
    "unit": "TM-042&043",
    "desc": "Enter a world of fun and games at Kiddytopia, a family-friendly play park kids are sure to love. The wide open space is filled with toys, play equipment and attractions for kids and adults to discover. Friendly staff are always on hand to provide assistance, oversee safety regulations and provide a clean environment throughout the experience. It’s a great place to be when you need some quality family time affordably!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE28Jan2020112049.jpg"
  },
  {
    "name": "Klinik Mediviron",
    "unit": "TM-012",
    "desc": "A reputable name in medicine, Klinik Mediviron is a go-to clinic for many due to its accessibility. There are 179 clinics across the country to date located in strategic residential, commercial and industrial areas. Not only that, truly comprehensive care is provided at every clinic to clients from all walks of life. The team of professional doctors and healthcare assistants work tirelessly to ensure the patient’s diagnosis, treatment and well-being are cared for to the best of their abilities.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile18Aug2020102538.jpg"
  },
  {
    "name": "Klinik Pergigian IMC Dental",
    "unit": "TM-039",
    "desc": "Ensure that you have a clean bill of health at IMC Medical Group, Johor Bahru’s first medical and dental integrated clinic. Your convenience and health is the top priority, which is why this clinic provides comprehensive medical care and service at fully-accessible locations. You’ll never miss another health checkup again!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile (1)25Feb2021172933.jpg"
  },
  {
    "name": "Marrybrown",
    "unit": "TM-027",
    "desc": "An international award winning quick service restaurant chain with 400 outlets worldwide and the world’s largest Halal brand - Marrybrown is proudly owned and operated by Malaysians. A true home-grown success that deliciously fused western fast-food with eastern flavors in their signature meals like satay burger, mee curry, chicken porridge and nasi Marrybrown alongside perennial favorites like Fish ‘n’ Chips, fun fries, salads and finger food. With outstanding service, great food and value-priced meals, this is the place to grab a quick tasty treat !",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Oct2019223802.jpg"
  },
  {
    "name": "MASTER TAM 谭师傅",
    "unit": "TM-023",
    "desc": "Destress, Me-time, wanting a little luxury in your life? Escape life’s daily stress at Master Tam with rejuvenating and therapeutic Borneo Massage, created from the best of Chinese, Malay and Indonesian massage styles with skilled masseurs from Sabah and Sarawak. Indulge also in manicures, pedicures and waxing services for a truly blissful experience for you.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Untitled-118Dec2019105702.jpg"
  },
  {
    "name": "Mr Dakgalbi Restaurant",
    "unit": "TM-031",
    "desc": "Come by Mr. Dakgalbi when you’re craving Korean food! Much like its namesake, Mr. Dakgalbi’s most popular dish is the dakgalbi, which is a spicy stir-fried chicken dish cooked in a delicious gojuchang-based sauce. This simple but mighty dish is prepared right in front of the customers, stir-fried to perfection with assorted fresh vegetables, tteok (glutinous rice cake), and kimchi. If you’re feeling fancy, you can add your choice of carb or additional ingredients such as shrimp, octopus, or cheese! Fancy something else? Mr. Dakgalbi also serves mouthwatering Korean fried rice and lip-smacking seafood pancake so there’s always something for everyone!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile15Jan2023105548.jpg"
  },
  {
    "name": "Nail By Le Beauty",
    "unit": "TM-025",
    "desc": "The perfect hang-out for you and your friends to pamper your feet and hands with super-luxe manicures, pedicures and all related services at Nail By Le Beauty. With professionally trained, experienced and friendly technicians offering over 400 different shades of high quality nail polish at value prices, this is a truly lavish affair that will not break your bank.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Oct2019223136.jpg"
  },
  {
    "name": "Nails Deco Gallery",
    "unit": "TM-017",
    "desc": "We all need a boost when it comes to the art of looking good. Nails Decor is here to polish you up with nail care services such as manicures, pedicures and enhancements! Give the rest of you an extra oomph with their essential beauty services such as eyelash extensions and waxing. Don’t sweat it––the staff here are discreet and absolutely professional, determined to bring out the best in you with every session.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Oct2019222334.jpg"
  },
  {
    "name": "Pet Lovers Centre",
    "unit": "TM-014",
    "desc": "Operating over 113 stores across five countries, Pet Lovers Centre is internationally recognised for providing the widest range of the freshest and finest quality pet food such as trusted brands like Fish4Dogs, Fish4Cats, Burp!, Barking Heads, Meowing Heads, Cat’s Best, Trustie and many more. Accompanied by vet-trained professional consultants, accessories and essential all-pet related services - this is truly a pet lovers haven.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Oct2019230839.jpg"
  },
  {
    "name": "PS Floral Atelier",
    "unit": "TM-007",
    "desc": "PS Flower Atelier is your one-stop boutique florist shop that provides fresh and luxe floral bouquets for all occasions or you can make your own arrangements at our DIY corner. Truly for the floral lover, we also provide workshops in floral arrangement and even special care services that provide plenty of TLC that would treat, care and heal any plant care concerns.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile16Jan2020120446.jpg"
  },
  {
    "name": "Ramah Ramah",
    "unit": "TM-010",
    "desc": "Jom, makan! At Ramah-Ramah, the food isn’t just tasty, it’s a wallet-friendly flavour fiesta! Serving authentic Malaysian cuisines at unbeatable prices, this homegrown eatery never skimps on using quality ingredients to cook up delicious traditional recipes. Step right into this cosy nook for a delightful meal, prepared hot and fresh just for you!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/RamahRamah-mobile_logo05Nov2023095925.jpg"
  },
  {
    "name": "REMAX",
    "unit": "TM-041A",
    "desc": "If it’s tech-related, Remax has it. This tech accessory brand caters to the generation that is constantly on the move. From bluetooth devices to keep music pumping, powerbanks and chargers to stay juiced, and phone cases to stay stylish––Remax is your one-stop shop for all your accessories and gadgets! All the products in store are regulated for quality, and curated for style. There are even novelty tech items that would make attractive gifts!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo19Jul201911325123Oct2019225417.jpg"
  },
  {
    "name": "Sheldonet Toy Store",
    "unit": "TM-013",
    "desc": "One is never too old for fun. Come by Sheldonet Toy Store and have fun checking out a wide range of pop culture toys and collectibles from global brands such as FUNKO, Bleacher Creatures, Cartamundi, and SoccerStarz. A tonne of fun is waiting in store just for you!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Sheldonet_LogoDesktop02Nov201618020523Oct2019222545.jpg"
  },
  {
    "name": "Siam Oasis",
    "unit": "TM-005&006",
    "desc": "Siam Oasis is a wellness management company with extensive experience in providing creative solutions for traditional spa businesses. Siam Oasis offers a wide range of massage services, performed by experienced therapists to help you live a healthier modern lifestyle. Each service is a great way to let you escape from all the bustle of life.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile18Apr2023091228.jpg"
  },
  {
    "name": "Siam Oasis",
    "unit": "TM-018",
    "desc": "Siam Oasis is a wellness management company with extensive experience in providing creative solutions for traditional spa business. Siam Oasis offers a wide range of massage services, performed by experienced therapists to help you live a healthier modern lifestyle. Each service is a great way to let you escape from all the bustle of life.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile28Mar2023173548.jpg"
  },
  {
    "name": "Sukiya",
    "unit": "TM-041",
    "desc": "Come into Sukiya for a taste of Japanese pop culture. Considered a Japanese comfort food, Gyudon (beef bowl) is a hearty meal of hot rice topped with thin beef slices simmered in broth. Sukiya is ranked No.1 Gyudon chain restaurant, so be prepared to enjoy a truly delectable meal! The menu also offers favourites such as tasty Ramen, Chicken Bowls, and unique Japanese Curry. The atmosphere is reminiscent of daily life in urban Japan, making the dining experience even more authentic.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Oct2019225158.jpg"
  },
  {
    "name": "Supreme Bowl",
    "unit": "TM-034, 035, 036 & 037",
    "desc": "Bowl in the dark in this glow-in-the-dark bowling alley! Supreme Bowl sets itself apart from traditional bowling alleys, featuring neon-lit lanes that light the way to thrilling bowling strikes. Whether you’re here to bowl it out with friends or to have a great time, Supreme Bowl promises fun for all with other games like 8-ball pools and electronic darts as well as food and drinks that can satisfy any cravings. Not only that, it offers out-of-the-world experiences with its futuristic and vibrant atmosphere, making it a great place for hosting parties. Get your friends and family together for a fun and memorable hang-out experience here!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/supreme bowl mobile10Sep2024224455.jpg"
  },
  {
    "name": "Thai Odyssey",
    "unit": "TM-011",
    "desc": "Step into a peaceful yet enchanting haven of relaxation. At Thai Odyssey, the serene tranquillity embraces the senses and the healing hands of skilled therapists uplift your physical and mental well-being. With restful thoughts and a peaceful mind, pamper and luxuriate in relaxing Thai massages and aromatherapy that will nurture the body and soul.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/TO-Logo_SKM-Mobile-app04Jun2024170544.jpg"
  },
  {
    "name": "The Craft Décor",
    "unit": "TM-001 & 002",
    "desc": "Creativity is unleashed at The Craft Decor, a place where personalisation is celebrated through getting crafty! A wonderful selection of artificial flowers, plants, decor accessories, door gifts and many more are available––how you use it is entirely up to you! This is a great destination to visit if you want to personalise your living space or special occasions such as weddings and parties.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Oct2019224730.jpg"
  },
  {
    "name": "Toy World Amusement X PinkFong Bebefinn",
    "unit": "TM-019&020",
    "desc": "Pinkfong Bebefinn-themed indoor playground by Toy World Amusement, specially designed for toddlers and young children aged 1–12. The play centre offers a safe and engaging environment with fun-filled zones like ball pools, slides, trampolines, and more. It’s the perfect place for little ones to explore, play, learn, and create joyful memories with family and friends.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/pinkfong Mobile18Jul2025173041.jpg"
  },
  {
    "name": "VR+Zone",
    "unit": "TM-022",
    "desc": "VR entertainment looks like it’s here to stay, so jump right into it and immerse yourself in the challenges it offers! VR+Zone is a space that has a myriad of VR scenarios: take off into space in a shuttle, escape a virtual prison or defeat enemies in a haunted house however you like! You’ll enjoy endless hours of fun here with friends new and old, so round them up and get the party started!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Oct2019231210.jpg"
  },
  {
    "name": "Wk Design",
    "unit": "TM-026",
    "desc": "Starting in 2015, WK Design has been filling the needs in our time surrounded by technology. Hands on in offering one of a kind accessories, WK Design provides contemporary designs to complement every latest mobiles. Look stylish in their range of Bluetooth earphones, share multiple high speed charging cables with your loved ones or get car mobile accessories for your trip, definitely a one-stop destination!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile15Dec2021181115.jpg"
  },
  {
    "name": "Absolute Thai",
    "unit": "T-035 & 035A",
    "desc": "Absolute Thai is a must for those who enjoy the vibrant flavours of Thailand. With over 20 years of experience, the restaurant believes in serving authentic Thai cuisine with hospitality from the heart. The use of authentic Thai spices and fresh ingredients creates a blend of flavours and aroma to every dish. Pick up the menu, and you will find delicious staples such as Tom Yam Kung, Pad Thai, a selection of hot curries and many more. All this is perfect with a bowl of pearly white rice, with a final sweet touch of Red Rubies or Sticky Mango Rice for dessert!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019120518.jpg"
  },
  {
    "name": "adidas",
    "unit": "T-058 & 059",
    "desc": "Football, basketball, running, training...Adidas has all this and more. Known for\nits constantly evolving technology, Adidas changes lives with its high\nperformance sportswear. The extensive range includes footwear, apparel, bags\nand accessories, all designed for you to achieve your fitness goals!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-adidas-mobile11Oct2019171314.jpg"
  },
  {
    "name": "ANTA",
    "unit": "T-030",
    "desc": "ANTA sportswear made its debut in the industry since 1991, with its brand focusing on functional sports attire and stands to lead internationally in the sports field of running, basketball, cross-training for its footwear, apparel and accessories varieties. The brand also offers subtle designs with an edgy touch, yet implementing sports science and innovation in their product development, prioritizing comfort in high performance standard making it accessible to everyone’s lifestyle with its affordable price range.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile29Sep2022160552.jpg"
  },
  {
    "name": "Arashi Shabu-Shabu",
    "unit": "T-022&023",
    "desc": "Arashi Shabu-Shabu gives you a deliciously wholesome Japanese hotpot experience like no other! You’ll be served your very own hotspot with a choice of soup base. Then, choose from a selection of freshly prepared ingredients, which will also be served individually to you! All you have to do next is enjoy your personalised meal in the comfort of a refined, tranquil environment.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019114855.jpg"
  },
  {
    "name": "Art Friend",
    "unit": "T-013",
    "desc": "Whether you are a professional artist or a hobby artist, Art Friend is the place to get all the tools you need for all your creative projects! Since 1981, Art Friend has been serving fine artists, graphic designers, crafters, hobbyists, and creative individuals as well as companies in the design industry with its vast catalogue of anything and everything arts and crafts related. Explore the different tools, paints, oils, brushes, pencils, papers, canvases, etc. and experiment with different textures and formulas to create your next masterpiece! Art Friend is a must-visit for every creative professional and art enthusiast alike.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile16Jan2023155712.jpg"
  },
  {
    "name": "asics",
    "unit": "T-024",
    "desc": "From daily commuting to outdoor adventures, ASICS has footwear and apparel to see you through your activity of choice. The Japanese brand has been developing activewear for over 50 years, hitting the sweet spot of form and function over and over again. Innovative technologies such as core GEL cushioning and Flytefoam encourage users to go further with every step they take. This eventually led to a range of performance-enhancing sports shoes and apparel that are perfect for professional athletes and active consumers alike.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019115139.jpg"
  },
  {
    "name": "Aurum Theatre",
    "unit": "AT-3",
    "desc": "Aurum Theatre is a new flagship ultra-luxurious boutique cinema by Golden Screen Cinemas. Featuring three halls with specially-designed Getha luxury recliners and Jin Gastrobar, a contemporary fine dining restaurant-bar – this is the ultimate place to indulge in a true cinematic luxury experience. Whether you’re just visiting to wine and dine or catching a movie with friends, Aurum Theatre is the place to pamper yourselves and loved ones or celebrate special occasions.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile14Nov2019085447.jpg"
  },
  {
    "name": "Bao Jun Hot Pot",
    "unit": "T-055",
    "desc": "The best meals are shared with loved ones. It is for that exact reason that steamboats are associated with warmth, laughter and a roaring good time! Gather your family, gather your friends; head to Bào Jūn Hot Pot for a grand time. Featuring a steamboat buffet with a wide variety of dishes, sauces, soup bases and more, explore new flavours you’ve never tasted before!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Bao-Jun-(Mobile)22Nov2020123302.jpg"
  },
  {
    "name": "Beutea",
    "unit": "T-026",
    "desc": "Enjoy an exquisite cup of tea beverage from Beutea! Beutea’s unique blends of Chinese tea with fresh milk and fresh fruits introduce new interesting flavours that refresh the palate and renew one’s love for tea. Each brew on the menu is crafted using an ancient four-step tea ceremony technique – moisten, soak, boil, and brew – to bring out the best flavours from the tea leaves just for you. Take a sip of these beautifully crafted tea beverages while relaxing in this modern teahouse!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile16May2023120904.jpg"
  },
  {
    "name": "BWAVE",
    "unit": "T-025",
    "desc": "If you are one of those trendsetters whose style is fun and quirky, BWAVE has got good news for you. Originally a curated clothing website inspired by culture, music, film, literature, art, and everything in between, BWAVE has brought their collection of apparel to the offline world for you to shop to your heart’s content. Their collection of independent and fashion-forward clothing, accessories, and bags will ensure that you would always be at the forefront of fashion!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo31Oct201912014925Oct2022154949.jpg"
  },
  {
    "name": "Carl's Jr",
    "unit": "T-053",
    "desc": "From hot dog cart to booming burger brand, Carl’s Jr has certainly gone a long way from its humble Californian beginnings. Carl’s Jr is now a premier burger brand that serves big juicy burgers made from premium quality ingredients. While you’re here, indulge in crisp hand-breaded chicken and cool shakes made from real ice-cream! It’s service with a smile all day, everyday here as your food is brought to the table by friendly staff––a true taste of Californian hospitality.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/CarlsJr-Logo---Web-Mobile09May2024102724.gif"
  },
  {
    "name": "Common Sense",
    "unit": "T-005",
    "desc": "Common Sense is all about having fun expressing yourself through graphic tees! Play with different styles and t-shirt collections with your favourite characters on them. On top of the t-shirts featuring your favourite childhood mascots, you will also find matching tote bags, socks, and caps that complete every collection. Each t-shirt collection is designed in a mix of street style and casual wear.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile12Mar2023143619.jpg"
  },
  {
    "name": "Converse",
    "unit": "T-037",
    "desc": "For as long as anyone cares to remember, Converse has been bringing the creative scene Chuck Taylor All Star and One Star sneakers. They are continuously revamping street style classics while redefining trends in sport, street and creative culture. A universally accepted symbol of style, Converse products––footwear, apparel, caps and accessories––will look just as good on a red carpet celebrity or you. The secret? It’s because you are owning it with your personality and unique self!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019120824.jpg"
  },
  {
    "name": "Crocs",
    "unit": "T-004",
    "desc": "There’s a good reason why Crocs has sold millions of shoes the world over. The classic Crocs clogs are made of lightweight, comfortable, odour-resistant resin––an absolute game-changer for casual shoes that suit a multitude of occasions! Since the arrival of Crocs clogs, the brand has diversified its offerings with flip flops, sandals, loafers and more. There are currently several distinct footwear collections for men, women and children all aimed to provide maximum comfort so that you may come as you are.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019112046.jpg"
  },
  {
    "name": "Crossover Concept Store",
    "unit": "TK-04",
    "desc": "Established right here in the heart of Johor Bahru, Crossover began as a small sneaker store by one man’s passion for sneakers. The brand is now known as a go-to haven for like-minded sneakerheads to seek out hard-to-find brands and upcoming streetwear names. Crossover carries a strongly curated collection for those who love independence and self-expression––it’s also a great place to discover a new culture and meet new people!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/crossover_logo_mobile24Oct2023095335.jpg"
  },
  {
    "name": "Crossover Concept Store",
    "unit": "T-032 & 033",
    "desc": "Established right here in the heart of Johor Bahru, Crossover began as a small sneaker store by one man’s passion for sneakers. The brand is now known as a go-to haven for like-minded sneakerheads to seek out hard-to-find brands and upcoming streetwear names. Crossover carries a strongly curated collection for those who love independence and self-expression––it’s also a great place to discover a new culture and meet new people!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019120221.jpg"
  },
  {
    "name": "Elle Hair Academy",
    "unit": "T-016",
    "desc": "Begin your hairdressing career today at ELLE Hair Academy - a widely recognised hair academy founded by Mr. Simon Koh. With his decades of hairdressing experience and his amazing ELLE Artistic Team, they are eager to share all their hairdressing knowledge, skills, and experiences with you throughout the course. Don’t know where to begin? Just make an appointment and learn from\nthe professional.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile09Jun2022144144.jpg"
  },
  {
    "name": "Elle Hair Studio",
    "unit": "T-017",
    "desc": "Get your best hairdo yet at ELLE Hair Studio, a hair salon spearheaded by founder and artistic director Mr. Simon Koh. The experienced hair stylists here know exactly what they’re doing, and will be happy to discuss your needs before giving you a haircut you’ll fall in love with. Your tresses can also be pampered with the numerous hair treatments and dyeing services on offer. Don’t know where to begin? Just make an appointment and make the cut!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile09Jun2022144144.jpg"
  },
  {
    "name": "Felancy",
    "unit": "T-019",
    "desc": "Expressing body-loving confidence through silhouettes that best fit the needs, Felancy offers numerous ranges from lingerie - junior to adult, shapewear and nightwear collection; even made available to the gents now. Every piece is made nominally priced with high-quality materials that perfectly fit our humid weather. Wait no more and stop by to shop your favourite piece now!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile29Oct2021084855.jpg"
  },
  {
    "name": "Fipper",
    "unit": "T-028",
    "desc": "Fipper is all about walking in comfort and confidence, bringing quality flip flops to the world! Made of natural rubber, Fipper slippers come in a myriad of eye-popping colours and styles. It’s simply a matter of choosing one that best suits you––the rest is just fun and adventure!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019115632.jpg"
  },
  {
    "name": "Fix Banana Leaf",
    "unit": "T-011 & 012",
    "desc": "Indulge in the intense flavours of South Indian cuisine, rich in aromatic spices and tangy tamarind! Fix Banana Leaf serves authentic South Indian dishes using traditional recipes and the finest ingredients. From mouthwatering curries to heavenly coastal delicacies, Fix Banana Leaf has a delectable menu that promises unforgettable culinary journeys.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/fix banana leaf logo01Jul2024095123.jpg"
  },
  {
    "name": "FIX IT ALL Auto Detailing",
    "unit": "Level 3B (Centre)",
    "desc": "Your car would look better than ever with FIX IT ALL Auto Detailing! It’s a one stop service that provides car washing, polishing and detailing. With more than 10 years experience in the industry, you can be sure that your car is in good hands. FIX IT ALL Auto Detailing also prides itself on assessing the service needs of customers and giving great solutions, rather than just providing a service. This keeps customers’ coming back and their cars clean and polished.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo29Jul2020192042.jpg"
  },
  {
    "name": "GIGI Coffee",
    "unit": "TK-03",
    "desc": "Get your caffeine fix at Gigi Coffee! Gigi Coffee is all about serving coffee on the go made from freshly roasted and ground 100% Arabica beans. Pick your choice of roasts: the medium dark roast from Indonesia offer an earthy taste with a hint of dark chocolaty sweetness while the medium roast from Colombia is velvety yet citrusy with a nutty hint. Don’t forget to take a peep at their seasonal menu for a creative twist on your favourite caffeine and non-caffeine beverages!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Gigi-Coffee-Logo-Mobile28Aug2023082248.jpg"
  },
  {
    "name": "Gong cha",
    "unit": "T-050",
    "desc": "Sip and savour chewy bubble tea at Gong Cha! Hailing from Kaohsiung, Taiwan, Gong Cha has been stirring up bubble teas globally since 2009. The term “Gong Cha” embodies the ancient Chinese tradition of presenting tea as a royal gift, expressing their passion to delight tea enthusiasts around the world with their premium milk teas. Take a delightful sip of their freshly brewed tea topped with a creamy layer of fresh milk foam, or indulge in some good old bubble milk tea!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/GongCha Mobile18Jan2024172840.jpg"
  },
  {
    "name": "GriPP",
    "unit": "TK-06",
    "desc": "Everyone needs a pair of comfortable rubber slippers! GriPP has an ever-growing selection of colourful flip-flops, slippers, and sandals that will get you excited for your next outdoor adventure. Whether you need a pair for the beach or sightseeing in tropical countries, GriPP’s cool, colourful, and practical sandals are all you need to style your feet.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/GRIPP Mobile17Oct2024173225.jpg"
  },
  {
    "name": "G-Shock Store",
    "unit": "T-029",
    "desc": "G-Shock is no stranger to the wristwear game: the brand has a devoted following for their range of digital and analogue watches. Featuring the latest collections of G-Shock, Baby-G, Edifice, Sheen and Protrek watches, this is the place to be if you’re looking to one-up your accessory style!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019143935.jpg"
  },
  {
    "name": "Hoops Station",
    "unit": "T-027",
    "desc": "Hoops Station is every basketballer’s dream: the leading Basketball Specialty retailer has the widest selection of footwear, apparel accessories, equipment and lifestyle products for the game! Not only do they offer the best of premium brands and styles, they also work with major sports brands so that you have access to the very all season long. If you want to stay ahead of the game, head to Hoops Station today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019115457.jpg"
  },
  {
    "name": "HYPE",
    "unit": "T-006",
    "desc": "HYPE Clothing Co. brings together a fusion of classic American subcultures with a local twist. The apparel collection offers both trendy men and women options in tops, trousers, caps, accessories and more. The casual, free-and-easy style here complements those who seek out individuality and urban trends.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile11May2023101009.jpg"
  },
  {
    "name": "HYPE",
    "unit": "T-021",
    "desc": "HYPE Clothing Co. brings together a fusion of classic American subcultures with a local twist. The apparel collection offers both trendy men and women options in tops, trousers, caps, accessories and more. The casual, free-and-easy style here complements those who seek out individuality and urban trends.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile10Jun2020172539.jpg"
  },
  {
    "name": "Impulse Gaming",
    "unit": "TK-05",
    "desc": "Impulse Gaming is every gamer’s haven – video games, consoles, gaming peripherals, accessories, and more in every corner of the store! Whether you’re a pro player or a casual gamer, you will find what you need to beat high scores. Step into this gamer’s paradise and supercharge your hobby to the next level with toys, figurines, blind boxes, and much more!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo (3)29Jan202417553331May2024173208.jpg"
  },
  {
    "name": "Impulse Gaming",
    "unit": "T-001",
    "desc": "Impulse Gaming is every gamer’s haven – video games, consoles, gaming peripherals, accessories, and more in every corner of the store! Whether you’re a pro player or a casual gamer, you will find what you need to beat high scores. Step into this gamer’s paradise and supercharge your hobby to the next level with toys, figurines, blind boxes, and much more!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo (3)29Jan202417553331May2024173208.jpg"
  },
  {
    "name": "Jean Yip",
    "unit": "T-018",
    "desc": "Firm to their core value; “Trust, Value & Friendliness”, Jean Yip has a strong team of more than 800 professionals in offering all-inclusive beauty services; from hairdressing to beauty, and slimming. Jean Yip strives to convey their most effective and quality alongside its latest technology of products for their clients. Leading the industry with their specialty, Jean Yip has been awarded numerously and will continuously hold onto their secret success of excellent relationship with the community.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23May2023151601.jpg"
  },
  {
    "name": "JIN Gastrobar by Aurum Theatre",
    "unit": "AT-3",
    "desc": "With an approach of a relaxed wine and dine, Jin Gastrobar is the perfect place to unwind after your long day. Having experienced chefs prepping your choice of appetizers to main courses, Jin Gastrobar offers  authentic cuisine made with only high-grade ingredients, bringing you an amazing culinary experience first hand. Pick from breakfast to dinner with your loved ones to lounge in or just listening to the jazz soothing melodies over cocktails and sharing canapes.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile01Jun2022145021.jpg"
  },
  {
    "name": "Kappa",
    "unit": "T-038",
    "desc": "Modernly designed with technical function in their sportswear collection, Italian sports and lifestyle brand, Kappa, has been one of the world’s largest Italian Sports & Lifestyle brands since 1967. Kappa is best known amongst sports clubs such as football, rugby and basketball, providing suitably designed apparel to accessories with collections from stylish chic fashion pieces, streetwear, sportswear and sports equipment.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile28Oct2022164221.jpg"
  },
  {
    "name": "Kinsahi",
    "unit": "T-054",
    "desc": "Enjoy a premium Japanese dining experience at Kinsahi where fine dining meets authentic Japanese flavours. All ingredients are sourced for their freshness and authenticity in order to create delicious, exclusive dishes. Vegetarians will love to know that Kinsahi also has an ever-expanding menu of Japanese vegetarian dishes!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019122858.jpg"
  },
  {
    "name": "LOJEL",
    "unit": "TK-08",
    "desc": "LOJEL creates carry essentials that simplify movement, enabling individuals to focus on what matters. Founded in Japan in 1989, LOJEL’s mission is to empower journeys with products that promote mindful movement & sustainability. Guided by 3 key principles—\"Less, but better\" ensuring quality design; \"Simply User-Centric\" prioritizing your needs; & \"Modern Movement\" offering adaptable solutions—LOJEL delivers innovative solutions for all movement, from international travel to everyday commutes.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/lojel mobile02May2025171000.jpg"
  },
  {
    "name": "Lucky Mala Noodle",
    "unit": "T-008",
    "desc": "A perfect bowl of MalaTang is from a recipe that has been a heritage passed on for generations over 100 years through a series of trial and error. It’s the foundation of flavor in every bowl of soup. Using only the finest selection of beef and pork bones, our broth is boiled for more than 10 hours, using 18 different types of spices, along with traditional Chinese herbs.\nIt is then cooked till golden, which signifies that it’s ready! Choose your favourite ingredients, level of spiciness and numbness, and you’ll enjoy a heavenly bowl of Lucky Mala Noodle!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Lucky mala Mobile28Sep2025102638.jpg"
  },
  {
    "name": "M.U OPTIK",
    "unit": "T-047",
    "desc": "Mentari Unggul (MU) Optik provides eyewear products and services under one roof. The fast-expanding company strives to offer quality lenses and frames to their customers while maintaining reasonable price points. Also available are comprehensive eye examination services that cover eye pressure, degrees of myopia and presbyopia, astigmatism, retina and eye structure. Everything needed for healthy eyes is right here at MU Optik!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019144828.jpg"
  },
  {
    "name": "MiX.STORE",
    "unit": "T-045",
    "desc": "MiX has developed an online fan base for their selection of regional snacks, food and beverages. If you crave a snack from your favourite K-Drama, or want to revisit your favourite Taiwanese snack, chances are you will find it here. You will also find self-heating hot pots from China, ice creams from Japan, instant meals from Thailand, crisps from Indonesia and so much more! Don’t wait, start shopping at MiX today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile25Jan2022094406.png"
  },
  {
    "name": "Momo Nail Concept",
    "unit": "T-020",
    "desc": "Manis and pedis are a delightful treat, and Momo Nail Concept takes the experience up a notch with nail art designs that range from demure to outstanding. Asides from a rad manicure, you can also enjoy beauty services such as hair removal and bridal makeup here. Mix and match the services on offer and you’ll leave Momo Nail Concept a more radiant, confident woman!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019114732.jpg"
  },
  {
    "name": "Nam Heong Ipoh",
    "unit": "T-040",
    "desc": "Meet the gatekeepers for a rich Ipoh heritage: Nam Heong White Coffee. The coffee shop has been spreading the state’s culinary treasures across Asia, serving delectable dishes that range from savoury noodles and dim sum to sweet desserts. The full menu is best paired with a cup of Nam Heong Ipoh white coffee for a truly unforgettable experience!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019121341.jpg"
  },
  {
    "name": "New Balance",
    "unit": "T-051",
    "desc": "New Balance is a proud American footwear brand based in Boston, Massachusetts. It is the only major shoe company that manufactures athletic footwear in the US and the UK. The brand is known the world over for its innovative sports shoes and apparel that accommodate a whole spectrum of users. Many swear by the brand’s footwear as it delivers comfort and maximum performance with every run!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-web27Aug2019145252.jpg"
  },
  {
    "name": "New Era",
    "unit": "T-056",
    "desc": "After decades as the official on-field cap of MLB, New Era is now the go-to brand for exclusive sports headwear. With classic cap styles, superb quality and embroidered team logos across 3 major U.S leagues, this is the ultimate symbol of a true fan. New Era headwear also has its own following in the urban streetwear scene for their versatility and style. If you want in on this, head over to New Era today!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019142536.jpg"
  },
  {
    "name": "Nike",
    "unit": "T-002",
    "desc": "You’ve heard all about it, now it’s time for you to Just Do It. Nike is here with a mission to expand human potential through groundbreaking, high-performance sports wear. Find ergonomic footwear for popular sports and activities as well as training attire, accessories and fitness technology. Not only that, Nike goes the extra mile by pushing for sustainably-made products, while creating a diverse global team and waves of community impact. That’s a lot of positive energy put into each item here!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019111817.jpg"
  },
  {
    "name": "OVER",
    "unit": "TK-01",
    "desc": "OVER is more than just a brand; it’s your go-to for sports products that help you reach your peak performance. With a focus on quality, OVER aims to create a community that supports local athletes, celebrates victories, and sparks positive change. Whether you're hydrating or recovering, OVER is here to help you be your best self, one sip at a time!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/OVER Mobile03Oct2025112950.jpg"
  },
  {
    "name": "Palsaik Korean BBQ",
    "unit": "T-048 & 049",
    "desc": "Fun fact: Palsaik means ‘Eight Colours’ in Korean, and it is best known in Palsaik Samgyupsal: a famous pork belly dish from South Korea! Palsaik Korean BBQ prides themselves in providing an authentic experience for you to enjoy this eight-coloured pork belly dish. You’ll be bowled over by the colours and flavours of the dish’s spectrum: Ginseng, Wine, Pine Needles, Garlic, Herb, Curry, Miso and Gochujang (Korean red pepper paste)––each has been carefully prepared for maximum impact. Grilling the meat releases its marinade and natural juices, creating an unforgettable meal! If you want a slice of Korea without booking a flight, Palsaik Korean BBQ is a must visit.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019145031.jpg"
  },
  {
    "name": "PopCorn Food Hall",
    "unit": "T-010",
    "desc": "Solve the age-old question of ‘what to eat?’ at PopCorn Hall, an international non-halal food hall bursting with tasty options! Choose from local delicacies to tempting eats from around the world. No matter your choice, each meal will be prepared with fresh, quality ingredients for your enjoyment!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Logo27Aug2019114220.jpg"
  },
  {
    "name": "RA-MEN BANKARA",
    "unit": "T-039",
    "desc": "Ramen Bankara is a Tokyo staple, now here to serve its steaming bowls of ramen to famished locals! It’s no secret that the broth is its winning quality: pork bones and ingredients are simmered for hours on end to produce a creamy, rich soup base for springy noodles and toppings such as chashu, onsen eggs, seaweed and more. Each ramen bowl is prepared upon order so you know you’re getting a fresh, hearty meal every time!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019121157.jpg"
  },
  {
    "name": "Salomon",
    "unit": "T-057",
    "desc": "Fuel your passion for outdoor sports! Founded in 1947 in the heart of the French Alps, Annecy, Salomon is a trailblazing footwear brand that is all about performance and innovation. Superior in function, radical in design, and obsessive in style, Salomon designs performance apparel for every level of running and style. Unleash the best version of yourself and transform your sports experiences with Salomon!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Salomon Mobile25Sep2025165852.jpg"
  },
  {
    "name": "SEK TONG by 深夜食糖",
    "unit": "T-043",
    "desc": "For those who love Hong Kong for its delicious desserts, head to 深夜食糖 SYST to fulfil your cravings! The dessert house has a menu filled with traditional Hong Kong tong shui and snacks, prepared with quality ingredients. Fall in love with the fragrant Mango Pomelo Sago and Black Sesame Soup, then sample dishes such as Macaroni, Curry Fish Balls, Salted Egg Toast and so much more! The neon lights and communal benches are also a nod to the classic Hong Kong experience, providing an atmosphere that feels just like the real thing.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019121621.jpg"
  },
  {
    "name": "Shihlin Taiwan Street Snacks",
    "unit": "T-009",
    "desc": "Everyone’s favourite Taiwanese food chain is here! Featuring night market staples, Shihlin Taiwan Street Snacks is the place to enjoy authentically prepared dishes like XXL Crispy Chicken, Crispy Floss Egg Crepe, Handmade Oyster Mee Sua and Seafood Tempura. Everything is made to order with fresh ingredients for the ultimate crunch or slurp! Want a taste of Taiwan’s street food culture? Get it right here at Shihlin Taiwan Street Snacks.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019113841.jpg"
  },
  {
    "name": "Shojikiya",
    "unit": "T-044",
    "desc": "Discover your favourite Japanese snacks and food items here at Shojikiya! Packed with over 1000 food products imported from Japan, you will find candies, chocolates, cookies, biscuits, chips, seaweed, ice-cream, frozen foods, oils, sauces, beverages, and even wines made in Japan. Shojikiya brings to you the latest popular items from all over Japan and makes sure to have an extensive range of items – including new and exotic products – for you to choose from. Visit Shojikiya today to pick out a new Japanese snack or learn how to cook amazing Japanese food using authentic cooking ingredients!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile19Dec2022144619.jpg"
  },
  {
    "name": "Showcase",
    "unit": "T-034A",
    "desc": "Smudged, worn, slippery or thin soles? Drop by Showcase, the one-stop solution to breath new life into your old footwear or to protect your brand new ones. Offering services from cleaning to water-repellent treatment of your footwear to head accessories, come visit us to put new shine into your most prized possessions.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile24Sep2020180300.jpg"
  },
  {
    "name": "Sin Man Kee HK Char Chan Teng",
    "unit": "T-052",
    "desc": "Experience what it’s like dining in a char chan teng in Hong Kong at Sin Man Kee HK Char Chan Teng! Serving up delicious beef noodles perfected over three generations, this cosy eatery knows how to deliver flavourful meals that pack a punch. Slurp on savoury beef noodles, indulge in heavenly Hainanese chicken rice, and revel in the spice of HK style lamb curry! Don’t forget to pair your mains with a rich cup of milk tea and end your meal on a high note with their flaky Portuguese egg tart.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Website Mobile New08Oct2024121845.jpg"
  },
  {
    "name": "Soxworld",
    "unit": "TK-02",
    "desc": "Warm essentials and more can be found right here at Soxworld, a retail outlet that specialises in socks, undergarments, winter accessories, caps and sleepwear. You will definitely find something that captures your heart, as the shelves are stocked with designs for any stylish individual! From novelty graphics to sleek and understated, everything here is a joyful addition to your warm wear wardrobe.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019120040.jpg"
  },
  {
    "name": "Sun Paradise",
    "unit": "T-036",
    "desc": "There is always something inviting about cool, sparkling waters, and Sun Paradise has all the apparel you need to accept the invitation! Be it a beach hangout or pool party, this retailer has you covered in aquatic wear and accessories. Find dozens of designs for swimwear here: one-piece suits, tankinis, bikinis, trunks, surfwear and even a special modesty range of Muslim swimwear. For those who want to take it up a notch, Sun Paradise also offers a range of dive gear and snorkel equipment, too.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019120652.jpg"
  },
  {
    "name": "Sushi Zanmai",
    "unit": "T-046",
    "desc": "Enjoy an authentic Japanese meal experience at Sushi Zanmai, home to the quintessential conveyor-belt sushi! More than 100 sushi assortments are available, prepared by hand with the freshest ingredients. If you want more than bite-sized delights, peruse the menu of mouth-watering Japanese dishes such as udon, tempura and rice sets. Sushi Zanmai also brings monthly delicacies from Japan, so go often to get a taste of what’s in season!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019122047.jpg"
  },
  {
    "name": "The Coffee Bean & Tea Leaf",
    "unit": "T-041",
    "desc": "Every drink is handcrafted with love at The Coffee Bean & Tea Leaf! From light and subtle roasts to dark and distinctive cups of liquid gold, the passionate baristas here are always ready to serve. Enjoy your favourite brew alongside delicious pastries or all-day breakfast. Don’t forget to try something from the seasonal drinks menu when you’re feeling extra fancy!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile14Mar2023175806.jpg"
  },
  {
    "name": "Timberland",
    "unit": "T-003",
    "desc": "You’re probably no stranger to this iconic outdoor footwear, apparel and accessories brand. Designed with a passion for the community spirit, it’s the one- stop gear outfitter for anyone who wants to connect with and enjoy the great outdoors.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019143302.jpg"
  },
  {
    "name": "Tokyo Japanese Cuisine",
    "unit": "T-042",
    "desc": "Tokyo Japanese Cuisine offers over 300 Japanese dishes, including sashimi, sushi, tempura, Wagyu beef, ramen, hand rolls, sushi rolls, appetizers, and elaborate set meals. The restaurant's elegant and simple interior design features wooden furniture and decor, creating a soft-toned, warm, and attentive atmosphere from the moment you step through the doors.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/123 (2)29Jul2024095621.png"
  },
  {
    "name": "Vans",
    "unit": "T-034",
    "desc": "At Vans, it’s all about self expression through street culture! The brand is internationally known for its originality in footwear, apparel and accessories. It is beyond a street fashion label, however. Vans encourages youths through its various creative platforms such as Vans Park Series, Vans Triple Crown of Surfing®, Vans Pool Party, Vans Custom Culture, and Vans’ cultural hub and international music venue, House of Vans. Lace up a pair and take your style onto the streets now.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019144520.jpg"
  },
  {
    "name": "Watsons",
    "unit": "T-031",
    "desc": "“Look good, feel great” in the world of Watson. With thousands of stores around Asia and Europe, the world of Watson has expanded to become Asia’s leading health and beauty retailer AND the No. 1 pharmacy brand in Asia. Find anything from skincare, cosmetics, beauty and healthcare products to pharmaceutical drugs right here, with personalized advice and counseling in health, beauty and personal care tailored to your very needs.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Aug2019144326.jpg"
  },
  {
    "name": "Zirconia Jewellery",
    "unit": "T-007",
    "desc": "For jewellery that heightens your lifestyle, Zirconia Jewellery has something to offer! With a vision to ‘shine your style with your sense of beauty’, the jewellery collections are of highest quality and carefully designed with your needs in mind. From statement pieces to everyday accessories, you’ll never leave the store without wanting more!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LOGO-MOBILE27Aug2019112717.jpg"
  },
  {
    "name": "AsterSpring",
    "unit": "S-020",
    "desc": "AsterSpring commits to give you a whole new refreshing experience, personalized to your overall skin health using specialized innovative facial treatments and incorporating homecare regimens with world leading brands including Dermalogica, the No.1 professional skincare globally, AsterSpring deliver the highest standard of skills and service quality that you can be - just relax, enjoy and see the visible results!\n\nTRUST, the best hands deliver RESULTS.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Asterspring Mpbile30Jun2025092537.jpg"
  },
  {
    "name": "Aveda",
    "unit": "S-021",
    "desc": "Aveda was founded with a mission to create natural, high performance hair care solutions that are gentle for you and the planet. With its ayurvedic roots, you’ll find that the hair care systems developed here not only treat your hair or scalp, but also provides an overall sense of wellbeing. Their wide range of products is 95% naturally derived and harvested from ingredients all over the world, proven to restore hair from the inside out.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170323.jpg"
  },
  {
    "name": "BabyShop",
    "unit": "S-047",
    "desc": "Trusted by parents around the world, BabyShop is a one-stop destination for all the things you need for your little ones. Discover charming nursery furniture, effortless travel systems, and quality feeding essentials that make parenting as easy as ABC. Introduce your angelface to educational toys and find cute clothing for newborn babies and children up to age 10, all in one place.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile22Nov2022091551.jpg"
  },
  {
    "name": "CelcomDigi",
    "unit": "S-009A",
    "desc": "Need a one-stop shop for all your mobile needs? Then make sure you head to CelcomDigi, where you’ll find everything to make life more convenient and easy. From the latest gadgets to the best mobile and internet plans in town, CelcomDigi is all about helping you make the right choices. Expect professional and friendly services from customer service assistants who will help guide you into getting just what you need – no frills, no fuss. Check it out now for the convenience you’ve always wanted!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/CelcomDigi Mobile28Jul2025114202.jpg"
  },
  {
    "name": "CHAGEE 霸王茶姬",
    "unit": "S-038A",
    "desc": "From the birthplace of tea in Yunnan, China, CHAGEE is here to bring back the beautiful heritage of Chinese tea culture sprinkled with a modern twist. Appreciate tea in its many different forms – infused in a classic teapot, brewed into a lovely milk tea or macchiato, or even as a fruit tea. The calming sound of trickling tea, soothing music playing in the background, and fragrant aroma of steeping tea will entice your senses as you step into the store and leave you wanting a taste of that delicious brew.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile17Nov2022090245.jpg"
  },
  {
    "name": "Chicco",
    "unit": "S-008A",
    "desc": "Being a pioneer in the baby and children product industry, Chicco Recaro prioritizes and comprehends every parents’ and child’s needs. Focusing on identifying common issues from strollers to carseats and researching to improve through innovative solutions. Believing that parenting is an unforeseeable adventure, the brand is here to walk alongside you with a helping hand, giving you the best tips in looking out for the suitable product for your little ones.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Jun2022135716.jpg"
  },
  {
    "name": "DAISO Japan",
    "unit": "S-042",
    "desc": "Daiso Japan is a franchise of 100-yen shops with an impressive range of over 100,000 products. You can find almost anything on the shelves catered to departments such as stationery, kitchen, beauty, home decor and more. All the functional products are a delight to look at and are made of quality materials. This adheres to Daiso’s emphasis on ‘Quality’, ‘Variety’ and ‘Uniqueness’. No matter what you’re here for, you will leave Daiso feeling more than satisfied!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019165143.jpg"
  },
  {
    "name": "Design Skin",
    "unit": "S-010",
    "desc": "A torch of modernity, HONOR is a brand that emerged from the needs of a young, tech-savvy generation. The brand is now one of the trendiest tech brands for youths that seek form, function and cutting-edge technology in one product. They are best known for their flagship smartphones, but also offer a range of gadgets and accessories that stand way out from the crowd.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/DS Mobile12Jun2025111730.jpg"
  },
  {
    "name": "D'LUXE Studio Spa",
    "unit": "S-002",
    "desc": "Your hair needs to be pampered, too! Get the royal treatment at D'LUXE Studio Spa, where professionals provide exceptional hair services. Adopting the unique Japanese value of “omotenashi”, staff here will go the extra mile to ensure comfort and satisfaction during your appointment. Simply immerse yourself in the serene ambience, as your tresses are anointed with products and equipment that protect both hair and scalp. A fabulous hairdo awaits!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile01Jul2020190043.jpg"
  },
  {
    "name": "DVC Borneo Wellness",
    "unit": "S-041",
    "desc": "Destress, Me-time, wanting a little luxury in your life? Escape life’s daily stress at DVC Borneo Wellness with rejuvenating and therapeutic Borneo Massage, created from the best of Chinese, Malay and Indonesian massage styles with skilled masseurs from Sabah and Sarawak. Indulge also in manicures, pedicures and waxing services for a truly blissful experience for you.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile15Apr2019144325.jpg"
  },
  {
    "name": "Dzi Kingdom",
    "unit": "S-018",
    "desc": "A Dzi (‘zee’) Bead is known in Tibetan culture as a gemstone that brings fortune and luck to the wearer. Every antique bead is handpicked from Tibet and the Himalayan mountains to assure its authenticity and quality. To find out which gemstone is best for you, step into Dzi Kingdom and explore the handpicked selection of Dzi beads that will bring prosperity, health, protection, compassion and healing into your life.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019180811.jpg"
  },
  {
    "name": "e Artistic",
    "unit": "S-005",
    "desc": "If funky and fun, pretty and gorgeous nails are what you are looking for - head to E ARTISTIC for a luxuriously pampering experience with a wide selection of lacquers, gel polish and nail art services. So come and let our well-trained technicians indulge you to help you look your very best.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile15Apr2019091308.jpg"
  },
  {
    "name": "ECHOLAC",
    "unit": "S-043",
    "desc": "Travel in style with Echolac! From premium to eco-friendly, and everything in between, Echolac has luggage cases fit for every traveller. Crafted from extremely durable and lightweight EchoLite polycarbonate, every Echolac luggage case comes with TSA-approved locks and almost-silent, 360-degree wheels for easy navigation. Its spacious interiors with multiple compartments make it wonderfully easy to pack and live out of your luggage, especially when space is limited. Get an Echolac for your next travels today!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/echolac mobile25Jun2025111347.jpg"
  },
  {
    "name": "Eyesmate Optometrist",
    "unit": "S-009",
    "desc": "Shower your eyes with some tender, loving, care at Eyesmate Optometrist, an optical centre that has been operating for over 2 decades. Professional eye consultations are top priority here, as the visionaries at Eyesmate see the need for quality eye care in the market. At least one optometrist is stationed at every outlet to utilise advanced devices for sharp, accurate consultations. Step inside today and give your eyes the attention it deserves!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile09Apr2019092311.jpg"
  },
  {
    "name": "Fitness Concept",
    "unit": "S-025",
    "desc": "Reach all your fitness goals with Fitness Concept––the health and fitness retailer provides a wide range of solutions from some of the best international brands. You’ll be able to test out treadmills, exercise bikes and training systems in-store. While you’re there, stock up on fitness apparel and accessories from renowned brands like Adidas, Reebok, Garmin and more!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019180249.jpg"
  },
  {
    "name": "Foto CLS Sdn Bhd",
    "unit": "S-039A",
    "desc": "If you’re looking for cameras that outperform any other in the market, Olympus is the answer. Remarkably stylish design matched with powerful features and high performance capabilities makes for the perfect shooting companion, if we don’t say so ourselves. Come in for a hands-on demo today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo19Jun2023171312.jpg"
  },
  {
    "name": "GAIAS",
    "unit": "S-034",
    "desc": "Your home is a sanctuary of comfort and elegance, and GAIAS embodies refined minimalism with handcrafted bedding and bath essentials crafted from the finest materials. As a homegrown lifestyle brand, GAIAS is committed to creating the world’s healthiest, softest, and most sustainable products, enhancing your everyday living with quality and quiet elegance.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/GAIAS Mobile22Oct2025171021.jpg"
  },
  {
    "name": "Getha",
    "unit": "S-019A",
    "desc": "Specializing in 100% Natural Latex since 1969, bedding experts GETHA has a wide range of products suitable for all ages and needs! From pillows for babies, teens and adults, to mattresses, bed frames, sleep and travel accessories, GETHA products are perfect with the best comfort and support for your slumber, or as a gift for a loved one! Whether it is on-the-go or for your sleep sanctuary, create your ultimate comfort indulgence with GETHA’s range of safe and EMF free products!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170944.jpg"
  },
  {
    "name": "Honor",
    "unit": "S-001",
    "desc": "Unveil the latest array of smart gadgets from HONOR! From cutting-edge smartphones to versatile wearables and powerful laptops, each product boasts exceptional performance and stunning design. With their sleek aesthetics and innovative features, HONOR’s lineup of intelligent devices effortlessly complements any busy lifestyle.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Honor Mobile01Apr2024143609.jpg"
  },
  {
    "name": "Hooga",
    "unit": "S-008",
    "desc": "Enjoy the ultimate cosy living with HOOGA, where simplicity and rustic products reign supreme. HOOGA strives to provide home furnishings like cushions, bedding, furniture and everything else you need to enjoy the simple pleasures in life, right at home. Shop at HOOGA today for a comfy, snuggly time!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019171808.jpg"
  },
  {
    "name": "Huawei",
    "unit": "S-028",
    "desc": "Huawei has scaled the tech ranks rapidly, and is now a popular choice for smartphone enthusiasts. The Huawei store features the brand’s best products in one place, so that customers can walk in and discover it all with the help of friendly store assistants. Find flagship smart devices, tablets and wearables right here, all with the quintessential seal of Huawei quality and sleek design.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile01Aug2019143133.jpg"
  },
  {
    "name": "iHospital",
    "unit": "S-039",
    "desc": "Everyone’s phone stops working once in a while, but you have nothing to worry about, because iHospital is here for you! Established in 2003, iHospital provides top quality repair services for smartphones. The professional services and expertise of the staff here will ensure that your mobile is returned to you in fine working order quickly and efficiently.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019163653.jpg"
  },
  {
    "name": "Jang Won Korea BBQ",
    "unit": "S-011&011A",
    "desc": "Jang Won Korean BBQ is the go-to place for an authentic Korean barbeque experience! Grill premium cuts of meat at the table and watch as the tender meat sizzle to perfection right in front of your eyes. Revel in the delicious flavours of smoky chargrilled meat wrapped in a ssam paired with traditional Korean side dishes. Awaken your tastebuds with some spicy kimchi jjigae, mix a flavourful bowl of bibimbap, and have a shot or two of soju! Lastly, gather your friends, family, and everyone you love to share this authentic Korean dining experience!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23Dec2022084144.jpg"
  },
  {
    "name": "Johnson Fitness",
    "unit": "S-030",
    "desc": "Johnson Fitness helps you stay on top of your fitness goals. You could be a beginner or a seasoned gym-goer; there is something here for everyone at any level. Each quality, innovative product is designed to help you maximise every workout session. If you are looking to work on cardio, strength and conditioning, or want a full body stretch––Johnson Fitness has the equipment for you.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile20Jun2022094936.jpg"
  },
  {
    "name": "King Koil",
    "unit": "S-007",
    "desc": "Investing in high-quality bedding is not something you should sleep on! King Koil makes the job a breeze by offering a wide range of sleeping products. Take your pick on mattresses made from various materials, as well as different bed types, pillows and accessories. All that’s left for you to do is to lie back and enjoy a good night’s sleep!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019181120.jpg"
  },
  {
    "name": "Lash Up",
    "unit": "S-003",
    "desc": "Lash Up – Where Beauty Begins. Discover expert eyelash extensions, lash lifts, waxing, laser hair removal and eyebrow embroidery all in one place. Step into our chic studio and walk out feeling confident, refreshed, and effortlessly beautiful.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Lash up mobile01Jul2025170012.jpg"
  },
  {
    "name": "Lucky Gems",
    "unit": "S-006",
    "desc": "Come here if you want a decorative item that also boosts the Feng Shui of your space! You will find quality jade, crystal gemstones, pearls and more to adorn your home and yourself. Each piece is unique to itself, and has numerous properties such as love, luck, prosperity and overall wellbeing.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170441.jpg"
  },
  {
    "name": "MH Clinic",
    "unit": "S-004",
    "desc": "Start your hair regrowth and rejuvenation journey at MH Clinic! As the first LCP-certified hair clinic in Johor Bahru, MH Clinic offers a range of MOH-approved, science-backed treatments to help tackle hair loss concerns. Treatments and services include oral medication, topical solutions, injectables, and energy-based devices. Visit today to begin your personalised hair regrowth journey!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo_web_mobile08Apr2024165315.jpg"
  },
  {
    "name": "Mi",
    "unit": "S-024",
    "desc": "Founded in 2010, Xiaomi has garnered a reputation for high-quality, affordable technology. Mi fans love the brand for its relevant hardware and software, as well as internet services and accessories that all carry hard-to-beat price tags! At the MI Store, you will be able to experience the whole range of Xiaomi products: smartphones, TV, fitness bands and other constantly-evolving tech accessories.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019162512.jpg"
  },
  {
    "name": "MORSE",
    "unit": "S-033",
    "desc": "When it comes to smart home electronics, Morse has the essentials. Since its launch in 2018, Morse has been bringing forth innovative gadgets that blend form and function seamlessly. Explore the potential of smart living with their line of robot vacuums, cordless vacuums, and kitchen appliances. Live smarter with Morse.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Mobile Mobile New04Jun2024093411.jpg"
  },
  {
    "name": "Natura",
    "unit": "S-019",
    "desc": "Sleep comes naturally at Natura, an eco-friendly brand that promotes healthy, comfortable sleep. Innovation and technology come together to create a range of palm oil memory foam pillows, mattresses, and bedding products for uninterrupted slumber. Best of all, Natura products are manufactured with environmental responsibility in mind––so everyone can sleep well and do their part for Mother Nature, too!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019164756.jpg"
  },
  {
    "name": "Niko Hair & Nail Gallery",
    "unit": "S-016",
    "desc": "Have a look revamp in stylishly trendy cuts in eclectic industrial environment at Niko Hair & Nail Gallery. Cuts, highlights, dye, perms, curls - combined to give you the most modern look, with an edge. Not just interested in styles, Franco also takes care of the health of your scalp and hair through high-quality products. Searching for a look revamp? Head to Niko Hair & Nail Gallery now!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile14Sep2022095601.jpg"
  },
  {
    "name": "NITORI",
    "unit": "S-035&036",
    "desc": "Adorn your home in both fun and cosy ways with Nitori! Nitori has a beautiful selection of home furniture and interior decorations, giving you the freedom to design your own unique space and lifestyle. Coordinate colours, shapes, and styles with Nitori’s products that are highly harmonious, and spark joy in you and your family.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile15Dec2022111250.jpg"
  },
  {
    "name": "OPPO",
    "unit": "S-030A",
    "desc": "OPPO is here to stay for the generation of tech users who love style and usability. Their trendsetting camera phones are meticulously crafted, assuring users with its elegant design and breakthrough technology in mobile photography. The experience doesn’t end there: with quality service and a fantastic user experience, OPPO will stop at nothing to deliver the best it has to offer. Step into the world of OPPO and experience the difference for yourself!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo20Jul2020145228.jpg"
  },
  {
    "name": "OSIM",
    "unit": "S-026",
    "desc": "Bring well-being into your home with OSIM, a brand that inspires wellness through their massagers, air purifiers, and indoor fitness devices. Paired with excellent service and holistic health know-how, it’s no wonder people continue to turn to OSIM for all their indoor health spa needs!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019184343.jpg"
  },
  {
    "name": "Palo",
    "unit": "S-012",
    "desc": "Prepare for a fun-filled experience at PALO, an entertainment center for the whole family. Parents will love the games for kids, while friends can spend countless hours hanging out and playing on the latest gaming machines on offer. If you’re feeling lucky, try out one of the nostalgic crane machines and you might win yourself a prize or two!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185255.jpg"
  },
  {
    "name": "PC Image",
    "unit": "S-044",
    "desc": "All your IT needs can be met right here at PC Image, one of the largest computer retail outlets in Malaysia. Their shelves are well stocked with the latest computer and laptop models for all lifestyles. You can also get compatible accessories and other gadgets such as webcams and hard drives too. If you need some advice, just ask their friendly staff who will be more than happy to assist you.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019182405.jpg"
  },
  {
    "name": "Popular",
    "unit": "S-037",
    "desc": "Page-turners, writing instruments, techy gadgets all call Popular bookstore home. Your favourite one-stop bookstore carries fiction, nonfiction, school books and magazines in 3 different languages, amongst thousands of stationery, accessories and audio-visual offers. If you need gifting ideas, you’ll find plenty of notebook gift sets, collectibles and more to make any occasion special––plus beautiful wrapping paper to wrap it in! Make Popular bookstore your first shopping destination, just know it’s difficult to leave empty-handed!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019182306.jpg"
  },
  {
    "name": "Rosa Moda",
    "unit": "S-027",
    "desc": "Say your vows in style with Rosa Moda, with their promise to redefine femininity in weddings. Their designer gowns tell a romantic tale of each bride and groom, and their collections are brought in from Milan, Seoul, and Hong Kong. Let your love story unfold with the intricately crafted gowns today!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019184104.jpg"
  },
  {
    "name": "Samsung",
    "unit": "S-023",
    "desc": "Samsung, one of the world's largest electronics gadgets producer is currently here in Mid Valley Megamall! Catch the latest Samsung IT gadgets such as mobile phones, tablets, laptops and digital cameras all under one roof! Our friendly and warm team member are trained to help you select the perfect gadget for you!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019162949.jpg"
  },
  {
    "name": "Say Nails Services",
    "unit": "S-045",
    "desc": "Pamper your nails at Say Nails, where your enjoyment is top priority. Packages are catered to suit any moment of relaxation, so you can come in for either a quick fix or a full-length spa treatment. Rest assured that you are in good hands, as skilful manicurists will finish your nails off with gorgeous nail art of your choice. Just sink into the plush couches and get ready for some quality relaxation at Say Nails.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019182137.jpg"
  },
  {
    "name": "Sea Horse",
    "unit": "S-015",
    "desc": "Sleep tight with Sea Horse, a manufacturer of high-quality mattresses and pillows that everyone can afford. You may have preferences over your mattress, and Sea Horse delivers with high-density foams that offer various levels of firmness. Experience them all in the store, and you’ll quickly find one that will give you endless hours of blissful sleep.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019183053.jpg"
  },
  {
    "name": "SLUMBERLAND - United Kingdom 1919",
    "unit": "S-033A",
    "desc": "With the promise of “the most comfortable sleeping experience”, Slumberland brings you the best of bedding wonders. Long established in the art of sleeping well, the brand carries high quality mattresses with a classic British heritage. Years of experience is packed into each mattress or bedding product to ensure a good night’s rest. Best of all, you’re assured of first class after-sales service with every purchase!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019180023.jpg"
  },
  {
    "name": "SOGO",
    "unit": "AT-1",
    "desc": "SOGO first opened on 18 January 1994 in Kuala Lumpur and now spreading its wing to Johor Bahru.Known for bringing the best of Japanese hospitality and heritage to Malaysia, SOGO offers a pleasant and memorable shopping experience to its customers with wide array of merchandise assortment – from affordable must-haves to luxury items. Spread over 190,000 sq. ft., it serves as a social destination for shoppers seeking beauty, fashion, lifestyle, pampering, leisure and many more. There isn’t a better place to relax, catch up with friends, and experience an exciting new retail journey with us. Find out more details on store promotions on www.sogo.com.my",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile10Apr2019160511.jpg"
  },
  {
    "name": "Style by Andy Chan",
    "unit": "S-046",
    "desc": "Experienced in putting smiles on customers’ faces, get all styled up at Style by Andy Chan Hair Salon. A professional and multi-award winning hairstylist that gives you the most innovative and trendiest hairstyles in the hair industry while ensuring optimal hair and scalp health. Come get an instant style upgrade at one of the most chic hair salons in town !",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019181510.jpg"
  },
  {
    "name": "Style Vision",
    "unit": "S-040",
    "desc": "Find your latest gadget wants at Style Vision. This one-stop solution provides you with the latest IT products at prices you can’t refuse. Bringing computer and information technology to shoppers, Style Vision Concept Store is all about offering quality without compromising on customer service.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile16May2023124305.jpg"
  },
  {
    "name": "Taro Yuan",
    "unit": "S-018B",
    "desc": "Originating from Taiwan with over 200 stores, Taro Yuan has officially opened its first location in Malaysia! Indulge in authentic Taiwanese taro desserts made with ingredients sourced directly from Taiwan. Enjoy their signature handmade taro balls, red beans, sago, and chewy pearls, all perfectly paired with shaved ice drizzled with brown sugar, grass jelly, grass jelly ice, and a variety of hot desserts.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Taro Yuan Mobile28Oct2025111120.jpg"
  },
  {
    "name": "The Home+Care Shop",
    "unit": "S-039B",
    "desc": "Home+Care Shop has been committed to providing you the best of healthcare products at fair prices for almost 40 years. They stock quality products that include durable medical equipment, pain management, hypertension and diabetic care, daily living aids and many more. You will find numerous world renowned brands on their shelves, all chosen for their reliability and proven results. Above all, Home+Care Shop offers a solution for good health, personal safety and independence to those in need.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019163036.jpg"
  },
  {
    "name": "TMT Megastore by Thunder Match",
    "unit": "S-031&032",
    "desc": "Find your latest gadget wants at TMT Megastore by Thunder Match, Malaysia’s largest IT chain store. This one-stop solution provides you with the latest IT products at prices you can’t refuse. Bringing computer and information technology to shoppers, Thunder Match Hypermarket Concept Store is all about offering quality without compromising on customer service. Aside from professional advice, you can also expect maintenance and repairing services here. Be sure to sign up for its loyalty programme where you’ll get to enjoy a host of benefits like free extended warranty, free three years technical support at any Thunder Match service centre, special promotions and much more.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo15Apr202115284001May2021170335.jpg"
  },
  {
    "name": "Toys'R'Us",
    "unit": "S-048",
    "desc": "Toys\"R\"Us Asia is the leading toy retailer in Asia, with a massive network of brick-and-mortar and online stores all across Asia. It aim to offer a truly unique experience for every age group, from toddlers to teenagers and even for those young at heart through its vast range of products. At Toys”R”Us find fun and joy for the whole family with high quality products such as bikes, scooters, toys, outdoor playthings and even certified education toys",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019184427.jpg"
  },
  {
    "name": "UOB",
    "unit": "SK-01",
    "desc": "UOB Bank offers financial solutions to the people and businesses within and connecting with ASEAN. We create solutions tailored to your unique needs through data and relationship-led insights. Our comprehensive regional network and one-bank approach connects your business to new opportunities in ASEAN. We help businesses to advance responsibly and guide personal wealth to grow sustainably. We foster inclusiveness and environmental well-being for stronger societies. This is how we stay committed to forging a sustainable future for generations to come.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile01Jun2023123919.jpg"
  },
  {
    "name": "Vivid Concepts Gadget",
    "unit": "S-046A",
    "desc": "Malaysia’s fastest growing mobile operator, U Mobile, offers optimal mobile services to suit your needs. With a wide range of prepaid, postpaid and broadband plans, you will be connected anytime, anywhere! You can also get phone bundle plans, U Mobile’s latest offers and replace SIM cards here. Come and find out what’s in store for you!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Vivid-Concepts-Logo--M23Nov2023160623.jpg"
  },
  {
    "name": "Vivo American Pizza & Panini",
    "unit": "S-038",
    "desc": "The Horrigans’ secret recipe. The freshest ingredients. And the truest passion. Vivo brings them all together, combining the best of both modern and traditional pizza baking practices to deliver perfection at every bake. 33% larger than typical pizzas and made from freshly prepared dough, get ready for a taste-tastic experience that’s crunchy on the outside, and chewy within!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile (3)29Oct2021085432.jpg"
  },
  {
    "name": "Vivo Concept Store",
    "unit": "S-029",
    "desc": "Vivo’s tech gadgets put great emphasis on what you want: amazing audio, effortless interface, and a constant pushing of technological barriers. You’ll be impressed by Vivo’s smooth-performing features and specifications, all housed in sleek, modern lines. If you’re on the lookout for innovative gadgets to match your lifestyle, Vivo is definitely for you!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile10Apr2019144929.jpg"
  },
  {
    "name": "Zen Oriental",
    "unit": "S-017",
    "desc": "Giving you an extensive wellness experience through Zen Oriental body therapy that focuses on five important senses. Allowing your mind and body to destress while strengthen your immunity in a calm environment.\nA perfect relaxing place with various massage on the list, with optimum services through this combination, your need to rest during the time your body is reviving will be fulfilled.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile17Aug2022163911.jpg"
  },
  {
    "name": "9months",
    "unit": "F-021B",
    "desc": "9months is a brand with one goal in mind: to make every expecting woman’s new journey their most stylish one yet! There are plenty of choices in contemporary maternity and nursing apparel here, all designed with the modern mom in mind. Each piece is made so that women need not compromise their style as they go through the various stages of pregnancy. From work meetings to baby showers, there is a functional outfit for the chic mom-to-be here!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile24Jun2019152213.jpg"
  },
  {
    "name": "Al-Ikhsan Sport Plus",
    "unit": "F-008",
    "desc": "Welcome to a sport lover’s paradise! Al-Ikhsan Sports, award winning sports retailer and one of the largest in Malaysia, progressively aims high to be THE largest sports retailer in SouthEast Asia in the near future. From footwear to accessories and international or national team jerseys to lifestyle pieces. Authorised dealer of all your favorite sports brands like Nike, Reebok, Adidas, Asics and Puma, at competitive prices direct from the manufacturers. You will find it all here, at THE sports destination store.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019164151.jpg"
  },
  {
    "name": "Bata",
    "unit": "F-005",
    "desc": "Much endeared and known by all, Bata is a shoe brand with over a 100 years in the shoe-making business! Though many may know it for its school shoes, Bata also offers a wide collection of footwear to cater to families from all walks of life. From fashionable ladies heels to sophisticated men’s shoes, there is a perfect pair for everyone right here.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170517.jpg"
  },
  {
    "name": "BEGA",
    "unit": "F-031",
    "desc": "Since 1996, BEGA has crafted stylish, curve-flattering women’s wear with premium fabrics, precision cuts, and on-trend designs. Known for vibrant colors, luxurious textures, and elegant yet confident styles, BEGA offers high-quality fashion at accessible prices. A must-visit for the modern, fashion-loving woman.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/BEGA Movile26May2025143817.jpg"
  },
  {
    "name": "Caring Pharmacy",
    "unit": "F-022",
    "desc": "Established in 1994 by 5 pharmacists, who were course-mates in the School of Pharmacy, Universiti Sains Malaysia (USM), CARiNG is now a fast-growing pharmacy chain in Malaysia with outlets in various locations. With the motto “Caring is our profession” expect around-the-clock pharmacist consultations, free health screenings (selected) and high quality, competitively priced products.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019164500.jpg"
  },
  {
    "name": "City Chain",
    "unit": "F-007",
    "desc": "To find out what’s ticking in the watch world, City Chain is the place to be! The friendly wristwear brand brings in trendy watch styles for men, women and kids. Not only are well-known watch brands represented here, accessories and other timepiece paraphernalia can also be found on sale here.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170631.jpg"
  },
  {
    "name": "Clarins",
    "unit": "F-030",
    "desc": "Fulfil your beauty needs at Clarins, a leading French luxury beauty brand. With over 60 years of expertise, the brand has developed a broad range of beauty products with your well-being, balance and happiness in mind. Your skin will be rejuvenated by innovative approaches to beauty, harnessing the power of plants and technology to produce results that are effective and timeless.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170811.jpg"
  },
  {
    "name": "Clarks",
    "unit": "F-052",
    "desc": "For shoes marked with the guarantee of comfort and style, look no further. Clarks has been in the footwear business for decades, and really has it all. Men, women, kids and infants – everyone finds a shoe they love at Clarks.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile04Aug2021162916.jpg"
  },
  {
    "name": "Clinique",
    "unit": "F-002A",
    "desc": "Back in 1968, Clinique launched their first dermatologist-developed skin care range and has been a pioneer in the field ever since. Thoughtful of harmful ingredients that could cause skin allergies and irritants, their products are clear from parabens, phthalates and fragrance. Expanding from skin care to makeup range, even made available for the gent, every product is evaluated through various testing procedures to ensure they meet the highest standards on product safety and efficacy. Learn more now and let your skin decide.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile16Nov2021090255.jpg"
  },
  {
    "name": "Comfort Sole",
    "unit": "F-026",
    "desc": "Some would walk the extra mile to find the perfect footwear, but many journeys end right here at COMFORT SOLE! The global brand breaks tradition by emphasising comfort with every sandal and shoe produced. A pair will provide hours of effortless walking, standing or running, while its signature look has garnered a cult following for its casual flair. Look no further, because happy, healthy feet could be yours today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile04May2023124610.jpg"
  },
  {
    "name": "CU",
    "unit": "F-028",
    "desc": "Up for a visit to Korea but locally? CU definitely has it all — a one stop convenience store that offers imported items from Korean freshly cooked street food, tasty authentic beverages and snacks to their range of K-beauty products and local essentials. A great place where you can chill for a quick catch up session with your friends, enjoying bits of Korea.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile07Jun2022160735.jpg"
  },
  {
    "name": "CUIR",
    "unit": "F-044A",
    "desc": "Cuir Boutique carries bags for all occasions––literally! This retail chain has everything from travel luggages to backpacks; handbags and leather goods. All these are from some of the most popular brands around: Antler, Barry Smith, Victorinox and Corroco to name a few. Can’t find what you’re looking for? Speak to the staff for custom made items like leather sets, travel accessories and other premium gifts!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019161902.jpg"
  },
  {
    "name": "Di",
    "unit": "F-049&050",
    "desc": "Stand out from the crowd in sophisticated styles! Di is a Malaysia-based fashion brand that combines simplicity with avant-garde fashion. Its in-house line, Di Edition, pushes fashion boundaries with its original designs and quality fabrics, while Di Curated highlights local designer collections that complement its vision. Di also offers custom tailoring and styling services, allowing you to refine your style and express your individuality through a harmonious blend of form, versatility, and everyday sophistication. Step into Di for a mix of styles, all in one space!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile30May2023090720.jpg"
  },
  {
    "name": "Dr Ko Dermaceutical",
    "unit": "F-025",
    "desc": "Clients who go to Dr. Ko Dermaceutical swear by the efficacy of the skincare––and no wonder. With over 20 years of experience, Dr. Ko Dermaceutical skincare products utilize only the highest quality, medical-grade skincare ingredients. DR KO Dermaceutical has 4 ranges of skincare products, namely, Dermax Clinicare, Ko Dermacare, Three Series, and Ko Perfect.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile25Feb2021172558.jpg"
  },
  {
    "name": "ELLE",
    "unit": "F-002",
    "desc": "A ELLE, style is about everything. From the way a woman lives, to where she travels, to her taste in music, art, food, cars and technology. No need to live in Paris to get the Parisian style! Be Chic & Effortless with ELLE ready-to-wear collection. #ParisianAnywhere",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019190326.jpg"
  },
  {
    "name": "Empurau Restaurant 忘不了",
    "unit": "F-013",
    "desc": "Empurau Restaurant serves some of the best seafood that will impress the seafood connoisseur in you! Brimming with retro nostalgia, this Chinese restaurant is famous for its traditional wok-fried style and has 40 years of experience in Chinese culinary. Indulge in their seafood menu offered at dinnertime and delight in their signature Hainanese chicken rice and other local delicacies on their daytime menu.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile01Nov2022094851.jpg"
  },
  {
    "name": "Everbest",
    "unit": "F-029",
    "desc": "With over 30 years experience in the industry, Everbest has certainly left their footprint across Southeast Asia as a reputable shoe brand. Their range includes stylish options for both men and women, and covers styles for all occasions. Comfortable, long-lasting and impeccably well-made, every pair of Everbest is guaranteed to delight you for years to come!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185225.jpg"
  },
  {
    "name": "FITFLOP",
    "unit": "F-021A",
    "desc": "Embrace comfort with every step in FitFlop footwear! FitFlop believes that wearing great shoes with the right ergonomics underfoot makes a world of difference. Brilliantly engineered with world-class biomechanics, each pair provides the support needed to move comfortably. Whether you’re looking for sandals, slippers, mules, or loafers, FitFlop has trendy styles and classic footwear for both men and women. Nurture your body from the ground up and experience your first (but never last) pair of FitFlop in-store!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/fitflop_logo_mobile28May2024104406.jpg"
  },
  {
    "name": "G2000",
    "unit": "F-051",
    "desc": "G2000 is the go-to for clean cuts and fabrics, perfect for every savvy executive. Versatile collections consist of well-made business attire for all day comfort and style. G2000 also emphasises on affordable, quality workwear, so that you can look your very best without breaking the bank!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/g2000 mobile21May2025150719.jpg"
  },
  {
    "name": "Geb",
    "unit": "F-034A",
    "desc": "GEB is an artistic boutique that embodies striking, playful fabrics and styles. Their apparel complements all shapes and sizes, drawing out your individuality! Take a look at the casual wear, accessories and more guaranteed to make you stand out today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019180404.jpg"
  },
  {
    "name": "Gio Fabrics",
    "unit": "F-035",
    "desc": "Find whatever you need for tailor-made clothing at Gio Fabric, purveyors of fine apparel fabrics. With selections sourced from all over the world, there is variety enough for every outfit of your dreams! The range encompasses natural materials such as cotton and linen as well as quality synthetics like satin, chiffon and crepe. You can also find bridal lace, synthetic leather and scuba materials for more specialised projects! Not too interested in custom-made clothing? Not to worry, Gio Fabrics also offers a line of ready-to-wear apparel specially for the ladies!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile31Oct2019174221.jpg"
  },
  {
    "name": "Giordano",
    "unit": "F-006",
    "desc": "Giordano is a go-to for casual apparel. The easygoing range fits easily into any modern family’s lifestyle. Often opting for simple designs, Giordano apparel is well made and uses quality materials so that every item becomes a wardrobe staple. The simple, timeless styles suit everyone from all walks of life, living up to Giordano’s iconic brand value- World Without Strangers.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019172835.jpg"
  },
  {
    "name": "Hat Attack",
    "unit": "F-029A",
    "desc": "Find a whimsical hat story at Hat Attack where you will not only find hats in various colours, shapes and designs, but functionality as well, such as for ceremonial reasons, social status, or as a fashion accessory. Find the hat of your choice from the different hats placed within ‘frames’ of different pattern, shapes and sizes to indicate the style of type of hats available here. Come here and find the perfect hat for you to ‘put your best hat forward!’",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile10Apr2019123605.jpg"
  },
  {
    "name": "HI STYLE",
    "unit": "F-014A & 015",
    "desc": "Vibrant, lively, trendy and youthful! HI STYLE brings to you fun-loving but down-to-earth apparels that will keep you looking youthful and fashionable, without being pretentious. Get excited over the hottest tones in ultra-stylish garments at the fastest fashion fast-track store. Expect to find a wide variety of choices from the most basic essential garments to fashion-forward items for both genders at super bargain prices.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile16Jul2020092255.jpg"
  },
  {
    "name": "KOI The",
    "unit": "F-044",
    "desc": "Hailing from Taiwan, KOI THÉ embraces its origins by infusing its tea products with cultural perfection and impeccable quality. The refined taste of brewed tea has brought about a huge following, with customers lining up in throngs to taste it! The refreshing lineup of teas include traditional varieties of green and black tea. This is then mixed with fun toppings such as golden bubbles, grass jelly, and even aloe vera! Each sip has a fresh, delicate flavour with a soothing aftertaste––a perfect accompaniment to a day of shopping.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile08Jul2019180329.jpg"
  },
  {
    "name": "Laneige",
    "unit": "F-025A",
    "desc": "K-beauty hottest brand! LANEIGE maximizes the potential of energy from water with carefully selected range of natural ingredients to deliver the right solution for each skin concern. Because at Laneige, we know our water recipes hold the key to young and vitalized skin. Find trendy and fashionable range of skincare and cosmetics that make you “Sparkle My way” be your true self and be confident every day!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019174124.jpg"
  },
  {
    "name": "LEE",
    "unit": "F-009",
    "desc": "Style every type of denim with Lee! From casual chic to rugged edge, every Lee denim is designed for movement. Backed by over 130 years of purposeful design and craftsmanship, Lee is an iconic American denim and casual apparel brand that constantly inspires. Unleash your inner fashionista with Lee’s elevated denim essentials!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LEE Mobile19Apr2025124702.jpg"
  },
  {
    "name": "Lovisa",
    "unit": "F-002B",
    "desc": "Inspired from street style and fashion runways, Lovisa cater the perfect accessory ranges for its audience. Keeping up with the latest trend, Lovisa is every woman one-stop fashion accessories destination; offering from jewellery, head wear to fashionable timepiece. Perfect as your day-to-day staple pieces to gifting your loved ones, Lovisa collections are definitely a must-have and irresistibly bedazzling!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile30Jun2022094904.jpg"
  },
  {
    "name": "M.A.C.",
    "unit": "FK-01",
    "desc": "Achieve that flawless glam look with MAC Cosmetics! The cult-favourite brand is beloved by professional make-up artists and make-up enthusiasts worldwide for its high-quality formulas, ultra-pigmented shades, and extremely smooth and blendable textures. Play with colours and express your creativity with its superstar eyeshadow palettes, best-selling lipsticks, longwearing foundations, and other beautifully formulated products! Devoted to creating beauty products that celebrate inclusivity and diversity, there’s always something in store for everyone at MAC Cosmetics.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile01Dec2022095447.jpg"
  },
  {
    "name": "Madam Kwan's",
    "unit": "F-001",
    "desc": "Explore the rich, flavourful taste of Malaysian cuisine at Madam Kwan’s! Madam Kwan’s is a local favourite restaurant that dishes out uniquely created Malaysian delicacies inspired by the diverse cultures of Malaysia. From nasi lemak to assam laksa to sambal petai, these are just some of the delightful eats you will find here. Don’t forget to try their signature chicken satay, fruit rojak, and cendol for a complete, truly Malaysian meal.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile20Apr2023162942.jpg"
  },
  {
    "name": "Mamaway",
    "unit": "F-021",
    "desc": "Leap into motherhood with confidence with Mamaway! This beloved maternity and nursing clothing brand allows mothers and mothers-to-be to look fabulous when carrying a baby. Stand out from the crowd in trendy, innovative, and comfortable clothing that can be used before, during, and after pregnancy!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile08Mar2023104159.jpg"
  },
  {
    "name": "Melvita",
    "unit": "F-029B",
    "desc": "Melvita is a leading French brand that specialises in organic skincare. Simplify your skincare regime with their large range of organically certified products. You’ll find a range for each skin type as well as personal hygiene products, all formulated to gently cleanse you without chemicals, fragrances, parabens, mineral oils and formaldehyde.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Melvita Mobile08Aug2025110700.jpg"
  },
  {
    "name": "Montigo",
    "unit": "F-055",
    "desc": "Get sipping with Montigo! Born from a simple desire to create fun and customisable drinkware, Montigo makes staying hydrated fun again! Featuring spill-proof, leak-proof, and double-walled vacuum insulation to keep your drinks at the right temperature for hours on end, its well-designed products let you enjoy your favourite drinks on the go. Add a touch of personal flair by curating every detail of your drinkware, from colour to type of cap to engraving your name or an icon! Express your artistic style on your drinkware with Montigo!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Montigo Mobile11Sep2025155748.jpg"
  },
  {
    "name": "Mr D.I.Y Plus",
    "unit": "F-040 & 041",
    "desc": "Anything you need for a better, brighter home can be found at MR.D.I.Y.! This local star is Malaysia’s largest home improvement chain, pleasing customers nationwide with their wide selection of products and motto: “Always Low Prices”. With 20,000 products ranging from homeware to autocare, gifts and toys, it is almost impossible to leave the store empty-handed!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019164721.jpg"
  },
  {
    "name": "MST Golf",
    "unit": "F-043 & 043A",
    "desc": "MST GOLF is the leading golf service provider in Malaysia and beyond. With over 30 stores spread across South-East Asia, it's currently the largest and preferred golf retailer in this region. It offers the most comprehensive range of integrated golf services such as retail, wholesale, driving ranges, golf academies, corporate solutions and event management. With over 20 years in the golf retail industry, MST Golf definitely understands the needs of its customers better than most. True to its tagline “Everything Golf” find the widest selection of equipment, apparel and golf accessories. Step into MST Golf for the ultimate golf shopping destinations.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019180525.jpg"
  },
  {
    "name": "MUJI 無印良品",
    "unit": "F-038&039",
    "desc": "A calm, serene oasis-at-home is complete with MUJI. Embracing a belief of “no-brand quality goods”, MUJI products create a zen-like atmosphere within any space. Extend a feeling of tranquility and functionality throughout your home with the kitchenware, furniture, stationery and foodstuff on offer. MUJI’s refined aesthetics even extend to your wardrobe, so expect to find apparel and footwear that will make you feel right at home!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019162548.jpg"
  },
  {
    "name": "Naelofar Concept Store",
    "unit": "F-012",
    "desc": "Every modern woman will adore Naelofar Concept Store! What began as a humble online business is now a brick-and-mortar store where you can experience your favourite products before purchasing. The homegrown brand stocks a range of products such as instant shawls, cosmetic contact lenses, perfumes and many more. This is also the place to be if you’re looking for Naelofar Hijab and Abaya or NeeLofa Lens and Perfume!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019182552.jpg"
  },
  {
    "name": "Neubodi",
    "unit": "F-036",
    "desc": "Your answer to the perfect fit is here at Neubodi, a brand that strives for effortless body transformation through lingerie. Let the friendly shop assistants help you with a one-of-a-kind personalised fitting solution, then find the right size and cup for your body. You’ll feel comfort and confidence like nothing else with every purchase!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019184903.jpg"
  },
  {
    "name": "OBJET",
    "unit": "F-048",
    "desc": "Step into a world of stylish home decors! At Objet, you will find a plethora of homely objects that allow you to transform your home into a luxurious and cosy sanctuary. From simple minimalist designs to bold opulent patterns, this home and lifestyle store is a treasury of items made for varying moods and aesthetics. No matter the style you are going for, Objet probably has what you are looking for.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Objet Mobile16Dec2023101601.jpg"
  },
  {
    "name": "OPTICAL 88",
    "unit": "F-054",
    "desc": "OPTICAL 88 is your premier eye care specialist, offering high-quality services and products to suit your needs. Walk straight in and receive an eye inspection from a registered optometrist, before selecting a pair of frames that best suit you. With hundreds of styles from renowned brands, you will find yourself a perfect pair in no time! OPTICAL 88’s after-sales service programme ensures that your experience is a pleasant one from start to finish.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019182730.jpg"
  },
  {
    "name": "Optometris Anggun",
    "unit": "F-011",
    "desc": "Exude elegance with eyewear from Optometris Anggun! Fitted with some of the classiest and trendiest eyewear collections, Optometris Anggun also provides professional vision examinations so that you have what it takes to see the world in all its splendour. Explore the unique Malay aesthetics with a touch of simplicity and consult an expert for all your eyewear needs!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/OPTOMETRIS ANGGUN Mobile24May2024144705.jpg"
  },
  {
    "name": "OWNDAYS",
    "unit": "F-045",
    "desc": "OWNDAYS has the latest in eyewear styles, specially for you! This leading brand from Japan brings in a wide range of frames: from minimal, functional styles to statement frames that will get heads turning. The frames come in set prices between RM198 - RM498 and will be ready to wear in just 20 minutes after purchase. Owning a new pair of glasses has never easier!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/owndays mobile12Jul2024095227.jpg"
  },
  {
    "name": "Pierre Cardin",
    "unit": "F-037",
    "desc": "Find lingerie and intimates that are made from carefully studying the daily needs of Asian women. With years of industry experience in fashion, Pierre Cardin truly understands what makes each woman unique. Browse the collections fo the latest in colour trends, fabric and the latest in garment innovation at Pierre Cardin Lingerie.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile30Jun2020090227.jpg"
  },
  {
    "name": "Precision @ Seen",
    "unit": "F-020A",
    "desc": "Precision @ Seen brings you the best in luxury optical wear. The high-end retailer holds no compromise when it comes to customer service and providing distinctive eyewear. Find only brand names that have been brought in for their quality and avant-garde style. So if you’re in search of frames to stand out from the crowd, worry not, you’ve come to the right place.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019184033.jpg"
  },
  {
    "name": "Renoma",
    "unit": "F-032",
    "desc": "Since 1963, RENOMA has dressed sophisticated men and women who know what they want! Comfort, style and versatility blend seamlessly into RENOMA’s range of apparel and accessories. With timeless designs and a commitment to quality, it’s no wonder that RENOMA continues to be a wardrobe staple to this day.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Renoma mobile21May2025153800.jpg"
  },
  {
    "name": "Sasa",
    "unit": "F-033",
    "desc": "SaSa is a one-stop carnival for beauty products! With over 200 international beauty brands in-store, there is everything the heart could wish for and more. Find a wide range of cosmetics, skincare, bodycare and haircare here, and even a selection of home spa products for relaxing ‘me time’. Shop at SaSa today for quality, affordable beauty essentials.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019183458.jpg"
  },
  {
    "name": "SEOUL STREET",
    "unit": "F-034C",
    "desc": "Want an effortlessly chic K-pop look? Accessorise right with Agassy, a concept store that carries the trendiest fashion accessories from Korea! The shelves are a-glitter with high-quality, unique pieces that will quickly become wardrobe staples. Self-expression has never been so stylish!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/SEOUL STREET LOGO11Jul2024173255.jpg"
  },
  {
    "name": "SK Jewellery",
    "unit": "F-020",
    "desc": "SK Jewellery believes that everyone deserves to shine, which is why they’ve built their brand around this concept, crafting timelessly beautiful jewellery. Capturing natural beauty, luxury and allure, the brand has made high-quality jewellery attainable for every modern woman. Their contemporary collections are versatile for all life’s celebrations, making each one a special occasion.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019173427.jpg"
  },
  {
    "name": "Skechers",
    "unit": "F-003",
    "desc": "Skechers - the one-stop footwear solution for men, women and kids of all ages and for all activities. From performance-enhancing sneakers, to casual lifestyle footwear and the ever-popular GoWalk comfort walking shoes, Skechers is a global leader you can depend on for designing, developing and marketing high quality and wide-ranging footwear.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019165115.jpg"
  },
  {
    "name": "SOGO",
    "unit": "AT-1",
    "desc": "SOGO first opened on 18 January 1994 in Kuala Lumpur and now spreading its wing to Johor Bahru.Known for bringing the best of Japanese hospitality and heritage to Malaysia, SOGO offers a pleasant and memorable shopping experience to its customers with wide array of merchandise assortment – from affordable must-haves to luxury items. Spread over 190,000 sq. ft., it serves as a social destination for shoppers seeking beauty, fashion, lifestyle, pampering, leisure and many more. There isn’t a better place to relax, catch up with friends, and experience an exciting new retail journey with us. Find out more details on store promotions on www.sogo.com.my",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile10Apr2019160105.jpg"
  },
  {
    "name": "Sorella",
    "unit": "F-010",
    "desc": "Holding on to the belief that every woman treasures femininity through body loving, Sorella aspire to enhance your natural curve with their range of meticulously designed and high quality lingerie. Focusing further on designing lingerie that supports and shapes better, Sorella unearth the feminine side of you with their numerous picks on materials. Best time to discover your body and its natural beauty with Sorella premium lingerie collection.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile12Jul2022115847.jpg"
  },
  {
    "name": "Sports Direct",
    "unit": "F-042",
    "desc": "Not just your ordinary sporting goods shop, you can also find a wide variety of lifestyle, fashion and hobby paraphernalias right here. Carrying over 70 leading global sports designer brands such as Nike, Adidas, Under Armour, Puma, as well other well-known brands like Asics, New Balance, Skechers, Fila, Hi-Te, Karrimor, Slazenger, Everlast, Lonsdale and USA Pro, its no wonder Sports Direct is now UK’s largest sporting retailer!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile13Feb2023184101.jpg"
  },
  {
    "name": "SUB",
    "unit": "F-014",
    "desc": "A brand made for the night owl and partygoer, SUB has been a long time go-to for the clubbing community! They pride themselves in designing and manufacturing quality apparel for the fashion conscious: from tops to trousers, skirts to dresses, there is something for those who want to stand out in the club. The in-house design studio and manufacturing facilities mean SUB apparel can achieve the highest quality both in looks and material. Come on in and find your perfect outfit, then get the party started!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile01Nov2019192223.jpg"
  },
  {
    "name": "TGI Fridays",
    "unit": "F-056",
    "desc": "TGI Fridays brings you a feast like no other! Come and try famous, freshly made American recipes made to order. Whether you’re hungry for burgers, appetisers, sharing platters or more, it’s a great space for parties or a relaxing dinner. You can also enjoy the fun and friendly services, filled with people who’d like to make your day. Stop by at TGI Fridays for a distinctively different experience you’re sure to love!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile24Feb2022165028.jpg"
  },
  {
    "name": "TOMAZ",
    "unit": "F-046&047",
    "desc": "Invest in a pair of leather shoes without breaking the bank at Tomaz. This brand strives to eliminate high markups on leather goods, thus providing quality footwear with the lowest price possible. Shop for all things leather here: dress shoes, watches, bags and leather care are available under one roof.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185733.jpg"
  },
  {
    "name": "Trapo",
    "unit": "FK-02",
    "desc": "Protect your car floors from dirt and grime with Trapo! Trapo offers a fully tailored car mat solutions and automotive accessories for your car. This covers more than 400 car models across a wide range of brands. You no longer have to deal with car mats that don’t fit, or constantly slide around your feet. In fact, you can even order your car mat online, and pick them up in-store where Trapo offers free vacuum and mat installation.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo12Dec201919310704May2021182208.jpg"
  },
  {
    "name": "Travel For All",
    "unit": "F-004",
    "desc": "Choose the best way to travel in class and full functionality. Choose Travel For All. An established retailer that specializes in providing you with hassle-free travels with bags, luggages, winter wear and all you can think of accessories. Home to many international brands like Camel Active, Austin Reed, Legend Walker, President, Elle and more, get all your needs here at the hottest deals.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019184621.jpg"
  },
  {
    "name": "Triumph",
    "unit": "F-034",
    "desc": "Living out the dream #TogetherWeTriumph - Triumph, one of the world’s leading lingerie and underwear company with an inspiring global success story. It develops, produces and sells underwear, lingerie, sleepwear and swimwear, fusing exceptional quality in workmanship, unrivalled fit and the latest in fashionable design. From seduction to sports and infusing super-soft comfort and seamless style, Triumph sure to have the perfect fit bra for you.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019163152.jpg"
  },
  {
    "name": "Universal Traveller",
    "unit": "F-053",
    "desc": "Universal Traveller believes that travel can be light, functional, and stylish. As your best companion throughout your travels, Universal Traveller specializes in winter wear clothing, luggage, and travel accessories, making it your one-stop center for all travel essentials.\n\nUniversal Traveller explores innovative ideas and products to cater to the evolving needs of the modern traveler while ensuring optimal functionality in winter wear for all occasions—from leisure to work—to 𝐊𝐞𝐞𝐩 𝐔 𝐖𝐚𝐫𝐦.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile03Aug2022112614.jpg"
  },
  {
    "name": "USC",
    "unit": "F-042",
    "desc": "Encounter a whole new shopping experience at USC by Sports Direct where you can find the latest street styles alongside practical sportswear! Maintain an active lifestyle and look fashionable all at the same time. Browse the latest collections from international fan-favourite sports brands such as Puma, New Balance, Fila, Converse, Vans, New Era, Champion, and Asics, all under one roof.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile21Feb2023160102.jpg"
  },
  {
    "name": "VOIR Gallery",
    "unit": "F-018&019",
    "desc": "VOIR Gallery is a one-stop fashion house that offers a complete range of trendy clothing for the whole family! You’ll find eight notable brands here: VOIR, VOIR Accessories, SODA, SODA Kids, South China Sea, Applemints, G&H and Diadora- all catered to different aspects of your lifestyle. Shop here and you will find quality, stylish apparel to keep you on trend no matter the occasion.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019173323.jpg"
  },
  {
    "name": "WACOAL",
    "unit": "F-023",
    "desc": "Wacoal is all about comfort, form and function for women. Here, you will find a broad range of undergarments and lingerie that will accentuate your curves and boost your confidence. Browse the range of feminine bras, panties and corsets, or consult a Beauty Advisor in-store to find the perfect fit.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019184930.jpg"
  },
  {
    "name": "Young Hearts",
    "unit": "F-034B",
    "desc": "Young Hearts welcomes girls and young women to a world where lingerie is comfortable and fun! The undergarments here are all about soft textures, relaxed styles and lighthearted designs. It is the perfect wear for those who want to enjoy all-day comfort no matter the outfit. Apart from bras, panties and camisoles, Young Hearts also offers casual and sleepwear with a cute, feminine touch.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Youngheart Mobile20Jun2025110131.jpg"
  },
  {
    "name": "Zeiss Vision Center",
    "unit": "F-024",
    "desc": "ZEISS Vision Center, your 21st Century Eyecare solutions, creating a whole new shopping experience for consumers, from frame selection and precise vision measurement to personalize lens consultation, and finally getting the consumers a pair of spectacles that fits their needs. The high-quality consulting support, the use of the latest optometric technologies and brand quality of ZEISS precision lenses bring you an ultimate vision care solution. With us, you will find the right One-stop Eyecare Experience.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile29Apr2019150857.jpg"
  },
  {
    "name": "樂天皇朝 Paradise Dynasty / 美滋锅 Beauty In The Pot",
    "unit": "F-027",
    "desc": "Beauty In The Pot serves up a health and beauty hotpot experience! Savour six nourishing soup bases, all steaming hot, that are rich in flavour and highly nutritious. Coupled with the sumptuous menu of fresh ingredients and homemade specialties, Beauty In The Pot promises a delightful hotpot experience you’d want to share with everyone you love. \n\n\nParadise Dynasty brings you on a gastronomic journey through dynasties of China! Encounter northern and southern Chinese cuisine across generations and savour its exquisite flavours, indulging in the luxuries of the imperial culture. The world’s first 8 flavoured xiao long bao are a must-try, with flavours such as foie gras, truffle, cheese, crab roe, garlic, Korean kimchi, Szechuan, and of course, its signature classic flavour.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Beauty in the pot & Paradise Dysnasty Mobile16Jun2025110741.jpg"
  },
  {
    "name": "Antipodean",
    "unit": "G-072",
    "desc": "Antipodean is the perfect place to socialise and catch up with friends, family, and loved ones over a cup of coffee or two. Reminisce of the laid-back cafe culture in Europe, Antipodean serves quality coffee that leaves even the fussiest of caffeine lovers in awe. Gather here to experience exceptional brews and a good plate of tucker.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile31Jan2023094305.jpg"
  },
  {
    "name": "Baskin Robbins",
    "unit": "G-059B",
    "desc": "A dash of creative ingenuity and tons of fun infused with an unrivalled collection of ice cream flavors made Baskin-Robbins the world’s largest ice-cream chain shop! With new flavors introduced every month and a growing line of ice cream cakes to ice cream sundaes and beverages, just makes this the perfect place for all ice cream enthusiasts. So come join us for a tasty thrilling ice cream experience!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170843.jpg"
  },
  {
    "name": "Bath & Body Works",
    "unit": "G-063",
    "desc": "It’s all about making fragrance fun here at Bath & Body Works! Prepare to step into a cloud of fragrance as you wander through aisles and aisles of body lotions, shower gels, fine fragrance mists, and eau de toilettes that will soothe and pamper you. Too many options to choose from? Don’t fret,Bath & Body Works’ friendly and knowledgeable store associates will be more than happy to find you something that you will fall head over heels for.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170008.jpg"
  },
  {
    "name": "Bespoke Premium Centre",
    "unit": "G-032",
    "desc": "Get a fresh new perspective at Bespoke Premium Centre, an eye care centre with real vision! It’s the first in Malaysia to provide customisable, innovative products and comprehensive eye care services all in one place. Everything needed for bright, healthy eyes can be found here: from experienced optometrists, friendly assistants, and state-of-the-art vision testing equipment! It’s a customised optical solution experience just for you, so be sure to check it out.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185156.jpg"
  },
  {
    "name": "Bonia",
    "unit": "G-011",
    "desc": "Inspired by Italian design for its intricate luxury leather goods, Bonia was founded in 1994 and has been a leading fashion retailer throughout Asia. Classy yet everlasting, Bonia carries product ranges from bags, footwear and other accessories. Not only catering to women and men products, Bonia has now another division on living range, providing various choices of premium collection on tableware and tech accessories.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile01Sep2022092025.jpg"
  },
  {
    "name": "Braun Buffel",
    "unit": "G-029",
    "desc": "Established in 1887 by Johann Braun in Kim, Germany, Braun Büffel has gained its reputation over the last century as a designer and producer of top quality leather goods and accessories. Today, it is a premium brand known for exceptional workmanship, superior leather, classic elegance and contemporary appeal.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019162427.jpg"
  },
  {
    "name": "CARHARTT WIP",
    "unit": "G-006",
    "desc": "Established in 1994 by Edwin Faeh, Carhartt Work In Progress (WIP) develops its own collections based on original Carhartt workwear. The brand combines authentic adaptations of these robust American archetypes, while engaging with the subcultures that have embraced it. This, in turn, has seen Carhartt WIP place itself in a new context and bring forth its own classics. Carhartt WIP opened its first store in London in 1997 and today operates over 80 brick and mortar locations worldwide. It also has its own skate team and music department, while supporting an array of artists and releasing various in-house publications. Since 2010, Carhartt WIP has worked with a number of like-minded collaborators, including A.P.C., Converse, Fragment Design, Junya Watanabe, Nike, Underground Resistance, and Motown.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Carhartt mobile06Jun2025113436.jpg"
  },
  {
    "name": "Carlo Rino",
    "unit": "G-023",
    "desc": "Known for its contemporary yet ageless styles in leather goods as well as dapper looking footwear, Carlo Rino offers subtle yet fashion-forward designs in every collection. With added product range of timepieces, perfumes, and scarves, Carlo Rino is set to bring the trendy individualist in you, under one roof. The brand has always held on to its visions of “Fun, Vibrant, Invigorating Identity”, a perfect place to shop style that suits you best — from elegant workwear accessories to your casual chic look.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Apr2022161119.jpg"
  },
  {
    "name": "Chanel",
    "unit": "G-069",
    "desc": "The CHANEL BEAUTÉ Boutique is where you will meet the world of culture and creations of the House. Step inside a constantly evolving boutique and find a comprehensive range of CHANEL fragrance, makeup and skincare. You will also discover the mesmerising Les Exclusifs de Chanel fragrance collection: a range of scents that evokes the story of Gabrielle Chanel and reflects the life and character of Mademoiselle.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019164601.jpg"
  },
  {
    "name": "Charles & Keith",
    "unit": "G-025",
    "desc": "CHARLES & KEITH empowers women the world over through fashion. With modern footwear and accessories, each collection allows women to freely express themselves. Everyone can find shoes for every power walk imaginable here: stylish sneakers, hot stilettos, sexy sandals and everything else in between. Pair that with a matching bag and accessories- it’s no doubt that CHARLES & KEITH completes your outfit to perfection.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185054.jpg"
  },
  {
    "name": "Chi-Gui Mala Hot Pot",
    "unit": "G-058",
    "desc": "Chi-Gui mala Hotpot is the place to be for the most richly flavored spicy and herbal chicken broth hot pot. Offering two types of soup per hot pot with a wide range of ingredients and condiments that include premium wagyu beef and kurobuta pork, be sure you are in for a treat. Throw in some ultra-spicy, ultra-juicy barbecue lamb skewers and your trip to yummy paradise is complete.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185004.jpg"
  },
  {
    "name": "Christy Ng Shoes",
    "unit": "G-049A",
    "desc": "Shoe lovers will find it hard to walk past Christy Ng Shoes and not stop to browse! A homegrown brand, you’ll find unique, well-crafted shoes to fit all occasions: comfy mules for daily errands to spectacular heels perfect for galas and weddings. If you somehow can’t find what you’re looking for, Christy Ng even offers a 3D Shoe Design platform for you to create your dream pair of heels! What are you waiting for- head over to the boutique today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019181549.jpg"
  },
  {
    "name": "Coach",
    "unit": "G-071",
    "desc": "Coach is a global design house of modern luxury leather goods, ready-to-wear, footwear, fragrance, eyewear & a full range of lifestyle accessories. Founded in 1941, Coach has a longstanding reputation built on quality craftsmanship and is defined by its confident New York style. The brand approaches design with a modern vision, reimagining luxury for today with an authenticity and innovation that is uniquely Coach.\n\nCoach Mid Valley Southkey Mall store showcases the brand’s keen focus on heritage and craft, equipped with a Craftsmanship Bar offering leather care, cleaning and Coach Create* services.\n\n\n\n\n\n*Coming Soon",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019165658.jpg"
  },
  {
    "name": "Cotton On",
    "unit": "G-012",
    "desc": "Cotton On is a lively fashion label that delivers trends of the moment with a twist! The store is full of quirky, stylish apparel that covers womenswear, menswear, kidswear and accessories. Not only is Cotton On one to set trends, the brand is also a firm supporter of diversity, empowering people to express their styles through fashion! With fun finds and the freedom to dress up, it’s no wonder shopaholics make Cotton On their first stop at every shopping trip.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019171011.jpg"
  },
  {
    "name": "Diamond & Platinum",
    "unit": "G-035",
    "desc": "Diamond & Platinum is a haven for romantics and jewellery lovers. Their range consists of pieces crafted of the highest quality gems and materials, celebrating precious moment in love. Asides from their in-house brand Estrella Diamond, they are also an exclusive licensee of\nForevermark diamonds — elevating their jewellery to new, beautiful heights.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019180324.jpg"
  },
  {
    "name": "Dior",
    "unit": "G-037",
    "desc": "Discover the bold and imaginative world of Christian Dior at this exclusive beauty boutique. Dior offers a unique olfactory experience through their wide range of fragrances, trendy makeup and exclusive skincare collections. Explore your beauty potential through bespoke services by their skilled consultants, gain access to exceptional beauty events and much more. The new boutique is the ultimate destination for beauty lovers.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Mobile Dior29Nov2023114722.jpg"
  },
  {
    "name": "dipndip",
    "unit": "G-017",
    "desc": "Every self-confessed chocoholic must visit dipndip––a café that prides itself in serving chocolate sweets and desserts! Using only high-quality Belgian chocolate, each delectable concoction exudes a deep aroma and rich flavour. Choose from a wide array of treats: from crêpes to waffles to traditional hot chocolate in white, milk or dark chocolate. No matter the choice, it’s bound to satisfy anyone’s craving for chocolate!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile16Dec2019123547.jpg"
  },
  {
    "name": "Dyson",
    "unit": "G-039",
    "desc": "The pioneer of cord-free, bagless vacuum cleaners, Dyson has since expanded its product line to bring you home solutions with the same drive for efficiency and style. The experts at Dyson are constantly researching user interaction to develop products that are revolutionary in performance and use. Asides from flagship vacuum cleaners, gadgets such as purifying fans, hair care machines and dryers aimed to simplify your daily lifestyle. A team is always available in store to assist you with your purchase, and a stylist by appointment to experience the full prowess of the Dyson beauty technology!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile14Aug2019155917.jpg"
  },
  {
    "name": "ECCO",
    "unit": "G-063A",
    "desc": "ECCO is one of the world’s leading premium shoe brands, combining style and comfort. ECCO’s success is built on products with a great fit and top-quality leathers. ECCO is a highly responsible company that owns and manages every aspect of the value chain from leather and shoe manufacturing to wholesale and retail activities. Founded in Denmark in 1963, ECCO is family-owned, that holds on to the foundation of seeking innovation as part of brand improvement as well as portraying new standards in their collection.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile10Jul2022154525.jpg"
  },
  {
    "name": "EICHITOO",
    "unit": "G-040",
    "desc": "Make the city your runway with EICHITOO! Blending cultural aesthetics with modern styles, EICHITOO presents standout fashion pieces that are unlike any other. Discover clean lines and trendy silhouettes tailored for every occasion, from the office to casual days out in the city. With EICHITOO’s stylish pieces, every modern woman can achieve a polished look effortlessly.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/EICHITOO MOBILE10Oct2024155422.jpg"
  },
  {
    "name": "Elemis",
    "unit": "G-031",
    "desc": "Indulge your skin with the most luxurious skin care ritual! ELEMIS is a global British skincare brand with over 30 years of expertise that is passionate about taking care of your skin. With an aromatherapist’s soul, an artist’s spirit, and a scientist’s commitment to results, ELEMIS infuses soothing scents and feel-good textures into its revolutionary skincare formulas, creating award-winning skin care products you can’t help but love. Treat yourself to moments of luxury both day and night with ELEMIS!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Elemis mobile19Apr2025130344.jpg"
  },
  {
    "name": "Fila",
    "unit": "G-024",
    "desc": "Founded in 1911 in Biella, a small Italian town near the Alps, the FILA brothers established a knitwear and underwear company, taking advantage of the town’s rich resources. Over the years, the brand expanded by incorporating Italy’s distinct artistic color sense into its clothing, laying the foundation for what FILA is today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Fila Mobile04Aug2025163413.jpg"
  },
  {
    "name": "Focus Point Concept Store",
    "unit": "G-008",
    "desc": "Focus Point Concept Store is unlike any other Focus Point outlet, as it is designed with you and your needs in mind. You can walk right in and try on any eyewear you fancy, then have them prepared for you right away! Their one-stop solution offers you a quick and easy way to make a new pair of glasses.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile09Jun2021103045.jpg"
  },
  {
    "name": "Giorgio Armani Beauty",
    "unit": "G-036",
    "desc": "Giorgio Armani is renowned for its unparalleled elegance, and for almost 2 decades its beauty line has been enhancing the natural beauty in all of us rather than keeping it hidden behind a mask. The collection of couture cosmetics are completely in line with the world Armani strives to create; one that celebrates beauty from within, with the opportunity to reveal an individual’s true personality. This approach has culminated in makeup, skincare and fragrances that are rich in texture and inspired by nature.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile30Jul2025115926.jpg"
  },
  {
    "name": "HLA",
    "unit": "G-043",
    "desc": "HLA is a menswear brand catered to the hip, stylish urban male. Here at HLA, you will shop the most stylish outfits to stand out at every occasion. The brand strives to offer the best quality at affordable prices, so that you can continue to look your best without breaking the bank.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019172337.jpg"
  },
  {
    "name": "Hour & Minutes",
    "unit": "G-017A",
    "desc": "Discover classic and modern timepieces at Hour & Minutes – a multi-brand watch retailer that specialises in SEIKO watches. Carrying the full collection of SEIKO timepieces (think Prospex, Presage, Astron, King Seiko, Seiko 5 Sports, Lukia, and Seiko Premier), this watch retailer is happy to help enthusiasts grow their collections or find the perfect watch for everyday wear.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile20Mar2023145901.jpg"
  },
  {
    "name": "iORA",
    "unit": "G-027",
    "desc": "iORA hails from sunny Singapore and brings you workwear styles that are smart and versatile! The fashion-forward clothing range covers all your essentials: blouses, trousers, skirts, dresses, knitwear and outerwear. With silhouettes that drape and flatter, you will feel all-day comfort while maintaining all-day style. Shop here today, because iORA is all you need to look like the accomplished, confident urbanite that you are!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019164244.jpg"
  },
  {
    "name": "JD Sports",
    "unit": "G-062",
    "desc": "It’s all about the latest and greatest footwear for you at JD Sports. The British sneaker chain has been in operation for well over 30 years, bringing in the best sports and casual wear from all seasons. You’ll find brands like adidas, Nike, New Balance and Vans here, and even own-brands labels like Pink Soda and Supply & Demand. Pleasing both streetwear fans and sneakerheads alike, it’s no surprise that they are known as the Undisputed King of Trainers.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019172757.jpg"
  },
  {
    "name": "Jo Malone London",
    "unit": "G-068",
    "desc": "Fragrance is a personal statement. Imagine creating one of your own. Discover Fragrance Combining.™ Jo Malone™ scents can be worn solo or layered for truly individual effects. Freshen a rich floral with a citrus zing. Add spice for a warm allure. Create something unexpected. A long-time signature. Each fragrance is crafted from the highest quality ingredients by master perfumers. Tailor made, exquisitely simple, refined. And always with a touch of the unexpected, a characteristic of every Jo Malone™ creation.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/JoMaloneLondon_logo_desktop01Oct201516290701Dec201910474907Jun2022095851.jpg"
  },
  {
    "name": "Kiehl's",
    "unit": "G-070",
    "desc": "Founded as an old-world apothecary in New York’s East Village, Kiehl’s is a family-founded store with a long heritage. All the skin and haircare products here are formulated from generations-old cosmetic, pharmaceutical, herbal and medicinal knowledge. With all this dedication, it’s no wonder every customer leaves Kiehl’s smiling!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019173003.jpg"
  },
  {
    "name": "Lapisan Patisserie",
    "unit": "G-049",
    "desc": "Lapisan Pâtisserie, where the timeless artistry of French pastry traditions harmoniously blends with the vibrant flavours of Malaysia, crafting an exquisite fusion of local tastes and foreign techniques into every delightful creation. At Lapisan, each bite celebrates the art of lamination with 12 delicate, flaky layers that perfectly blends butter and dough, creating a unique pastry experience that tantalises your taste buds and fills the air with an irresistible aroma. Beyond this flaky perfection, we proudly showcase local craftsmanship through a selection of sweet and savoury delights, all offered at an accessible price for everyone to enjoy. Welcome to Lapisan Pâtisserie - where every layer tells a story.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Lapisan mobile18Apr2025120520.jpg"
  },
  {
    "name": "LEGO",
    "unit": "G-055",
    "desc": "The latest LEGO playsets and accessories could be yours when you visit the first LEGO Certified Store in Johor! There’s a playset for everyone, from starter kits for children to advanced playsets for master builders of LEGO. You’ll be able to build skyscrapers, futuristic vehicles, and so much more. There’s no end to the creativity you can unleash with LEGO!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile11Sep2020170102.jpg"
  },
  {
    "name": "L'Occitane En Provence",
    "unit": "G-044",
    "desc": "It all began in the markets of Provence. With nothing but an alembic, a small truck and a solid knowledge of plants, our founder, a 23-year-old named Olivier Baussan began distilling rosemary essential oil to sell locally. He expanded his production from oils to soaps to creams, taking inspiration from the land he grew up on to bring natural beauty to homes across the world.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019173155.jpg"
  },
  {
    "name": "Love & Co",
    "unit": "G-061",
    "desc": "Love & Co is a premier wedding jeweller that designs with ‘happily ever after’ in mind. Thoughtful, timeless, bespoke jewellery are their forte—creating engagement rings and wedding bands that not only celebrate a couple’s union, but are also priceless keepsakes. Couples who want a one-of-a-kind ring will revel in the personalisation and customisation services provided here.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019173252.jpg"
  },
  {
    "name": "Machines",
    "unit": "G-065",
    "desc": "Your Apple needs will be satisfied right here at Machines, where you can find the full range of Apple devices and accessories! Demo units are available for all the latest products, so you can experience each one before making a purchase. You will also find accessories such as speakers, phone and laptop cases, bags and more here- all of which will complement your latest Apple product!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019184507.jpg"
  },
  {
    "name": "Maison Berger Paris",
    "unit": "G-015",
    "desc": "Since its invention more than a century ago by Maurice Berger, Maison Berger is dedicated to purifying indoor air to provide you with a comfortable and pleasant living environment with its luxurious home fragrances. Its wide range of products are highly sought after, making them collectors’ items through the years. Indulge in the finest of fragrances created exclusively for Maison Berger by master perfumers from France.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile04Feb2020191720.jpg"
  },
  {
    "name": "Mango",
    "unit": "G-041 & 042",
    "desc": "Inspired by the breezy shores of the Mediterranean, MANGO is every trendsetter’s go-to for chic, relaxed, and effortlessly stylish outfits. Best known for its flattering, modern silhouettes that match the urban lifestyle, the iconic Spanish fashion brand lets the modern urbanite discover fashion-forward pieces that truly resonate. Explore its vibrant collection of clothing, accessories, and footwear for women, men, and children in-store!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/mango logo22Jul2024120823.jpg"
  },
  {
    "name": "Michael Kors",
    "unit": "G-038",
    "desc": "Cutting edge style takes centre-stage at Michael Kors, a celebrated designer amongst trendsetters and fashion personalities. His namesake company crafts luxury accessories and ready-to-wear collections for those who seek a distinctive touch of glamour. With the signature Michael Kors Collection and the MICHAEL Michael Kors labels, the brand showcases accessories, footwear, wearable technology, watches and fragrances that are coveted the world over.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019183750.jpg"
  },
  {
    "name": "MLB",
    "unit": "G-009",
    "desc": "Forward trends and old classics meet and mingle at MLB, a Korean fashion label inspired by American Major League Baseball culture. The brand has made waves in the fashion scene with their monogrammed apparel, footwear and accessories. Their iconic look can be seen on stars, influencers and trendsetters alike. For the fashion forward, MLB truly is the place to pick up the latest must-haves.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/MLBlogo mobile-114Aug2023112843.jpg"
  },
  {
    "name": "MONOLOQ",
    "unit": "G-060",
    "desc": "Express yourself through your personal style! MONOLOQ has fashion collections that allow the expression of self with pieces that embody classic elegance and distinctive styling. Whether you’re looking for versatile basics or statement pieces, its carefully curated and highly wearable collections are made to complement your modern lifestyle. Elevate your personal style with MONOLOQ!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/whatson/monoloq10Jul2024094829.jpg"
  },
  {
    "name": "Nespresso",
    "unit": "GK-02",
    "desc": "Experience the joy of tasting delicious brews every day with Nespresso! Nespresso elevates the coffee experience like no other with the touch of a button. With an exciting array of coffee flavours to choose from, each Nespresso capsule contains fresh coffee grounds sealed in laminated aluminium, preserving the highly coveted coffee aroma and rich flavour that are then extracted into a concentrated cup of dark elixir. Discover the Nespresso experience in stores today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Nespresso-logo-mobile31Jul2023094330.jpg"
  },
  {
    "name": "Onitsuka Tiger",
    "unit": "G-017B",
    "desc": "A true fusion of Japanese heritage and modern accents, Onitsuka Tiger has taken sports and urban culture style by storm! The legend lives on through its fusion footwear, updating classic silhouettes and creating completely new styles and collaborations with like-minded artists. No matter which path it takes, the brand continues to resonate with the spirit of Japan through each new collection.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019164845.jpg"
  },
  {
    "name": "Original Levi's Store",
    "unit": "G-026",
    "desc": "Trendsetter, style-lover, everyday commuter––no matter who you are or what your style is, there is a pair of Levi’s® for you! The brand is the epitome of classic American style and effortless cool, moving forward from their historical roots into the modern world. Even today, Levi’s® continues to pioneer the denim world by creating jeanswear, tops and accessories for the world to enjoy and express themselves with!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019175840.jpg"
  },
  {
    "name": "OUTPOZT",
    "unit": "G-057",
    "desc": "The latest Korean fashion concept store is lighting up the scene in Malaysia! OUTPOZT is designed to show off a whole range of Korean garment collections in an interior that’s sure to inspire your latest editorial shoot for Instagram. Come and strike a pose in a OUTPOZT’s inviting, modern minimalist interior that’s sure that be a Malaysia’s trendiest new lifestyle spot.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile11Sep2020170538.jpg"
  },
  {
    "name": "Padini Concept Store & Vincci",
    "unit": "G-047&048",
    "desc": "It is rare to find a true shopper’s paradise, but one can be found here at Padini Concept Store. The multi-brand company has reinvented the way Malaysians shop, with multi-fashion brands for women, men and children housed in a massive contemporary space. A whirlwind of styles and trends can be found in the various labels, namely Padini, Seed, Vincci, Vincci Accessories, PDI, Padini Authentics, P&Co and Miki. Apparel and accessories on offer not only provide on-trend looks, but also quality at unbeatable prices. Shoppers who just want a quick fix particularly love the store, as displays are fuss-free for maximum browsing!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019164330.jpg"
  },
  {
    "name": "Pandora",
    "unit": "GK-04",
    "desc": "Loved by women the world over, Pandora designs and brings hand-finished, contemporary jewellery to life. Every piece is designed so that women can embrace and express their individual style, creating a personal jewellery journey that is uniquely theirs. The range extends from Pandora’s signature charms to necklaces, bracelets, earrings and rings! It is truly a place for women to self-express unforgettable moments, so start your journey today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile-pandora27Jul2023170427.jpg"
  },
  {
    "name": "Parfums & Beauté",
    "unit": "GK-03",
    "desc": "Embark on new scented journeys with Parfums & Beauté! This unique and immersive retail experience welcomes all to explore and indulge the senses, as each month a new international brand takes centre stage – the likes of COACH, RABANNE, MONT BLANC, and many more. Its ever-changing backdrop sparks newfound intrigue as visitors take deep dives into each brand’s ethos, discovering and falling in love with their spellbinding curation of fragrances and scented products. Step into the world of luxury fragrances and perfume getaways, where each visit is ardently unforgettable.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/P&B mobile04Jul2024142905.jpg"
  },
  {
    "name": "PUMA",
    "unit": "G-066",
    "desc": "Being one of the pioneers in the athletic wear industry, PUMA is known for the comfort in contemporary designs that instill innovative technology for their product range. As PUMA holds on to the values that bring the best in every sports professional from soccer boots to running pairs has now offers an expansion in fashionable sporty apparels and accessories. If you’re hitting the streets, their urban wear collection will be guaranteed to make a bold statement. Browse the diverse range today!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile23May2022091557.jpg"
  },
  {
    "name": "Regency Medical Care Centre",
    "unit": "G-051, 052, 053 & 054",
    "desc": "Regency Medical Care Centre (RMCC) is a healthcare hub that is convenient and easily accessible, located right in the heart of the community. Brought to you by Regency Specialist Hospital of HMI Group, RMCC makes taking care of your health and well-being simple. From early detection through health screenings to enhanced health management, RMCC is able to provide swift diagnoses with the aid of a team of medical experts and advanced technology. RMCC blends high-quality services with accessibility and comfort, redefining the wellness journey and allowing you to receive the healthcare that you deserve. RMCC takes pride in offering a patient-centred approach, delivering comprehensive healthcare experiences for everyone and fostering the well-being of the entire community.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/RMCC_Logos_RGB-0130Jul2024122059.png"
  },
  {
    "name": "Royal Selangor",
    "unit": "G-010",
    "desc": "Founded in 1885, Royal Selangor is the world’s foremost name in quality pewter. From tableware,\ndrinkware, wine & bar to personal accessories, each piece combines a tradition of craftsmanship and\nmodern techniques.\n\nRoyal Selangor counts premier champagne houses Dom Pérignon, Krug, Veuve Clicquot, and major\nglobal brands, amongst its clients for bespoke commissions, and its collections include works by\ninternationally renowned designers.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Royal Selangor Mobile26May2025092722.jpg"
  },
  {
    "name": "Samsonite",
    "unit": "G-059&059A",
    "desc": "Pack confidence into every single journey with Samsonite! From large suitcases to small travel bags, Samsonite has bags for every type of trip. Explore smooth, smart suitcases that are light, durable, and functional with TSA-approved locks for your next long journey, or pick out a sleek, stylish backpack for carrying your laptop and daily essentials. Samsonite also offers briefcases, crossbodies, totes, and duffels as well as accessories to personalise your everyday and travel bags.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Samsonite Mobile25Aug2025114337.jpg"
  },
  {
    "name": "Sans & Sans",
    "unit": "G-064",
    "desc": "Ageless yet sleek with a touch of seasonal hues amongst its staple natural colours, Sans & Sans ready-to-wear collection offers contemporary designs with high quality hand-picked materials. Focusing on loose silhouettes with minimal cut twists in their design, every piece is meant to be worn with any shape, creating mindful collections for the wearer to pick from!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile22Jun2022104256.jpg"
  },
  {
    "name": "Sembonia",
    "unit": "G-046",
    "desc": "SEMBONIA has been gracing the fashion industry for over 20 years with their timeless array of leather products. Their extensive collection covers shoes, bags and leather accessories coveted by fashionable men and women. What sets the brand apart is their eye for detail and versatility — no matter your outfit, SEMBONIA will complement it and give your look a polished, trendy finish.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019182207.jpg"
  },
  {
    "name": "Sephora",
    "unit": "G-028",
    "desc": "Sephora lives by its philosophy to fully value beauty, driven by the demands of bold, excellence, energy, and freedom. It represents a contemporary concept that heightens the desire to live and dream about beauty every day, bringing an anthology of the world’s best brands to your fingertips. Known for discovering creative brands, highlighting trends, shaping aesthetic codes and administering tailor-made advice, Sephora is an experience that hits the target every time. It offers total freedom to walk-in, feel, dream, experiment and leave without feeling obliged to make a purchase. With its original products, avant-garde beauty services and innovative communication, Sephora celebrates audacity and truly breaks the mold when it comes to beauty retailing.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile10Apr2019113056.jpg"
  },
  {
    "name": "SHOPLOOOH",
    "unit": "G-020",
    "desc": "Be the cloud that give you comfort, be the sunshine that brighten your day.\n \nSHOPLOOOH aims to bring quality fcasual wear that is simple yet fashionable for every lady expressing the classic of beauty from true soul, enjoying lifestyle with personal taste.\n \nWear it, Feel It.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile06Sep2022130332.jpg"
  },
  {
    "name": "Sime Darby Beyond Auto",
    "unit": "G-018A",
    "desc": "Unlock a brand new driving experience with the latest electric automobiles by BYD at Sime Darby Beyond Auto. This official authorised distributor of BYD in Malaysia introduces the brand’s best lineup of innovative vehicles with cutting-edge Blade Battery technology. Experience sleek rides and go on thrilling road trips with BYD’s ultra-safe, efficient, intelligent, and stylish electric automobiles. Test drive today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile11May2023174717.jpg"
  },
  {
    "name": "SOGO",
    "unit": "AT-1",
    "desc": "SOGO first opened on 18 January 1994 in Kuala Lumpur and now spreading its wing to Johor Bahru.Known for bringing the best of Japanese hospitality and heritage to Malaysia, SOGO offers a pleasant and memorable shopping experience to its customers with wide array of merchandise assortment – from affordable must-haves to luxury items. Spread over 190,000 sq. ft., it serves as a social destination for shoppers seeking beauty, fashion, lifestyle, pampering, leisure and many more. There isn’t a better place to relax, catch up with friends, and experience an exciting new retail journey with us. Find out more details on store promotions on www.sogo.com.my",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019183924.jpg"
  },
  {
    "name": "Starbucks Coffee",
    "unit": "G-002",
    "desc": "Step into a whole new world of coffee at Starbucks Reserve, a place where boundaries are pushed and the art of coffee is cherished. Creativity is unleashed behind the counter onto each individually-roasted batch of coffee beans––brewing, aging, infusing and blending is used to create imaginative coffee creations. Nuances are enhanced, flavour profiles are sharpened, and coffee drinks are concocted like never before. It is a true haven for coffee lovers from all walks of life!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019175425.jpg"
  },
  {
    "name": "Swarovski",
    "unit": "G-013A",
    "desc": "Delivering a wonderlab of meticulously crafted jewellery & accessories, Swarovski brings artistry & elegance into the everyday lifestyle. Celebrate individuality & break the rules of style where innovation meets imagination.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile26Jul2021110812.jpg"
  },
  {
    "name": "Swatch",
    "unit": "G-013",
    "desc": "Positive provocation and joie de vivre made in Switzerland: since its founding in 1983, Swatch has shaken up the watch industry. Thanks to its striking designs which always reflect the zeitgeist, Swatch is one of the leading watch manufacturers and the most sought-after brands in the world — and has always stayed true to itself. The watchmaker continues to surprise, whether with regularly released new models or special collections.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019172714.jpg"
  },
  {
    "name": "Swiss Watch",
    "unit": "G-003 , 004 & 005",
    "desc": "Swiss Watch is a trusted and well-recognized luxury watch destination amongst watch enthusiasts, collectors and first-time watch buyers. Providing an extensive range of luxury watches such as Rolex, Bell & Ross, Breitling and Omega, our elegant boutique, enriched by professional expertise and exceptional service offers a comfortable environment to discover the perfect timepiece for you.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile10Nov2021091903.jpg"
  },
  {
    "name": "The Body Shop",
    "unit": "G-067",
    "desc": "The Body Shop’s new Activist Makers’ Workshop store is a place for play and discovery! It’s known for their cruelty-free and 100% vegetarian ingredients skin range as well body butter and scrub, every skin to body product. Expanded in make up and fragrances too, the brand keeps to their belief that “everyone is beautiful”. Find out more on this new concept store today!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile20May2022095354.jpg"
  },
  {
    "name": "The Coffee Bean & Tea Leaf",
    "unit": "G-016",
    "desc": "The Coffee Bean & Tea Leaf has been spreading their passion for the perfect cuppa since 1963. Seat yourself at a comfortable table, and choose from any number of carefully handcrafted products made from the freshest ingredients. The Coffee Bean & Tea Leaf is home to The Original Ice Blended® drink, but don’t stop there! Try the rich-roast coffee, fine teas and delicious pastries on offer as well. No matter your choice, you’ll be able to taste quality and perfection in every sip and nibble.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019182946.jpg"
  },
  {
    "name": "Tokyo Secret",
    "unit": "G-019",
    "desc": "Famed Hanjuku cheese tarts, sumptuous exciting fusion dishes and sinfully delicious desserts, all in a contemporary relaxed surrounding. If you are game for these head for Tokyo Secret fusion cafe now ! Using only natural and air-flown ingredients from Japan in an extensively creative menu, be assured of an unforgettable dining experience.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019165903.jpg"
  },
  {
    "name": "Tomei",
    "unit": "G-007",
    "desc": "Tomei captures every special moment in your life with perfect jewellery crafted from gold and diamonds. With over half a decade of proven expertise, Tomei offers fine diamond engagement rings, wedding rings, and other treasures you and your loved ones will cherish. If you need something truly special to mark a new chapter in your life, Tomei is the place to be.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170548.jpg"
  },
  {
    "name": "Tonkatsu by Ma Maison",
    "unit": "G-018",
    "desc": "Delight in the crispy perfection of deep-fried golden brown pork cutlet at Tonkatsu by Ma Maison! Hailing from Nagoya, Japan, Tonkatsu by Ma Maison serves up succulent tonkatsu perfected by avid food connoisseur and Chef Akinori Terazawa, using superior meat cuts and authentic culinary techniques. The result is tonkatsu so juicy and tender, you’ll come back for more! At Ma Maison, or ‘my home’ in French, it’s all about welcoming customers into a warm and comfortable restaurant to experience a selection of masterfully-made tonkatsu dishes.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/mamaison_mobile1-106Sep2023111209.jpg"
  },
  {
    "name": "TRT",
    "unit": "G-056",
    "desc": "Expressive individuals know their wardrobe styling well. TRT offers a collection for the individualist in you as every piece is designed by an in-house team with sustainability in mind. Either you are styling separate pieces or one-piece, every TRT collection has that versatile functionality and timeless hues for you. Not only on apparels, TRT has an amazing collection of fashion accessories; from hats, scarves to bags, for you to pair up!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile03Nov2022170534.jpg"
  },
  {
    "name": "TSL | 謝瑞麟",
    "unit": "G-025A",
    "desc": "TSL Jewellery has put the sparkle into occasions with their trend-setting craftsmanship all over Asia. Find exquisitely designed jewellery in diamond and precious gems that are suited to many of life’s best moments. It will be a moment like no other with jewellery by TSL Jewellery.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019184736.jpg"
  },
  {
    "name": "Tudor",
    "unit": "GK-01",
    "desc": "TUDOR is an award-winning Swiss-made watch brand, offering mechanical watches with sophisticated style, proven reliability and unmatched value for money. The origins of TUDOR date back to 1926, when “The TUDOR” was first registered as a brand on behalf of the founder of Rolex, Hans Wilsdorf. He officially set up the Montres TUDOR SA company in 1946 to produce watches that respect the traditional Rolex philosophy of quality at a more affordable price point. Throughout their history, thanks to their robustness and affordability, TUDOR watches have been chosen by some of the boldest adventurers, on land, in the air, underwater and on ice. Today, the TUDOR collection includes iconic lines such as Black Bay, Pelagos, 1926 and Royal. Since 2015, TUDOR has also offered models with mechanical Manufacture Calibres with multiple functions and superior performance.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile21Oct2023110828.jpg"
  },
  {
    "name": "UNIQLO",
    "unit": "G-033&034",
    "desc": "Uniqlo is a modern Japanese company that inspires the world to dress casually. It started in 1984 and has since grown to over 1,900 stores in 23 countries worldwide, including 48 physical and an online store in Malaysia. From T-shirts and sweaters to denim and outerwear, Uniqlo's clothes are highly versatile, made precise according to exacting Japanese standards for quality, and come in an astonishing variety of colours and styles.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019182239.jpg"
  },
  {
    "name": "Victoria's Secret",
    "unit": "G-045",
    "desc": "Find the right scent for you at Victoria’s Secret Beauty. For every mood or occasion, choose from a fresh, bright, warm or dark scent available in fine fragrances, mists and lotions. Try our most glamorous fragrance, Bombshell Eau de Parfum! Treat yourself to self-care essentials, lip, travel accessories, bags & backpacks, keychains and more.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile27Jul2020174933.jpg"
  },
  {
    "name": "Xixili",
    "unit": "G-014",
    "desc": "On the hunt for the perfect lingerie fit? You’ll find it at XIXILI, a homegrown lingerie label founded by ladies, for ladies! Pleasantly surprised by their improved bust-lines through the right brassiere choice, these ladies have perfected the art of lingerie through their exquisite collections and industry know-how. You will find beautifully made intimate wear here, and the professional in-house fitters will ensure that you find one perfect for your body shape.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185947.jpg"
  },
  {
    "name": "Yves Saint Laurent",
    "unit": "G-030",
    "desc": "From fashion comes beauty, and Yves Saint Laurent is taking it to greater heights! The Parisian couture brand now showcases a mesmerising array of luxury beauty products. Browse cosmetics in delightful shades and tints, breathe in the heady fragrance of signature scents, and be pampered by sensuous skincare. All this while creating a look that is truly, uniquely you. Your Own Rules? It’s here and now at Yves Saint Laurent.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185623.jpg"
  },
  {
    "name": "A&W",
    "unit": "LG-045",
    "desc": "Come on in to A&W, a fast food chain home to the signature Root Beer Float! No one can resist the ice-cold root beer from tap with creamy vanilla ice cream on top. As you’re enjoying your beverage, order a warm Coney hotdog, burger or fried chicken platter to go with it. This casual, American-style dining experience is perfect for all ages, so round up the family and enjoy a get-together today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/SKM_A&W_Logo_Mobile19Apr2019162319.gif"
  },
  {
    "name": "APOLLO Pick-A-LiciOus",
    "unit": "LGK-07",
    "desc": "The APOLLO brand, founded in 1953, boasts a rich history and has grown from a modest local business into a leading name in the confectionery industry. Renowned for its exquisite chocolate confections and layer cakes, APOLLO's dedication to quality and innovation has fueled its expansion into international markets, establishing a strong global presence.\n\nAPOLLO is embracing a bold new chapter with APOLLO Pick-A-LiciOus, modernizing our brand to resonate with a new generation of snack enthusiasts.\n\nDesigned as an immersive brand experience, the kiosk invites consumers to taste, feel, and connect with APOLLO in a fresh, engaging way. It redefines snacking moments as indulgent escapes, bringing APOLLO closer to their hearts and hands",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/apollo mobile29Jul2025121547.jpg"
  },
  {
    "name": "Auntie Anne's",
    "unit": "LGK-08",
    "desc": "Shaped and baked to perfection at each outlet, Auntie Anne’s is a family favourite not to be missed. Each pretzel is warm, golden, and has a delightful chewy bite. Everyone will have their favourite flavour and choice of dip, but be sure to try sweet Cinnamon Sugar or tangy Sour Cream & Onion. Pretzels are perfect for any time of the day, so it’s no wonder there is always a line at Auntie Anne’s!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019161728.jpg"
  },
  {
    "name": "AWG Fine Watches",
    "unit": "LG-025",
    "desc": "AWG Fine Watches brings together beautiful timepieces under one roof. Expect to see renowned brands and timeless quality in all the watches here. The collection presented has been carefully selected, then paired with personality and warmth that can only find be found in a family-owned business.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile07Dec2022111214.jpg"
  },
  {
    "name": "B.O.D 包栈",
    "unit": "LG-008",
    "desc": "Founded by an enterprising duo in 2015, Bao On Demand has since turned into the largest bun and dim sum chain store in Johor Bahru! Having served its local clientele with delicious steamed buns and dim sum, it’s now here for you to experience as well. Choose from soft buns with fillings such as barbecue pork or red bean, then enjoy some siew mai, har gao and a myriad of other delectables! Everything on their menu is prepared fresh daily, so all you have to do is come over to Bao On Demand and enjoy.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Logo15Jan201917174608Jul2022103925.jpg"
  },
  {
    "name": "Box Hunt",
    "unit": "LGK-18",
    "desc": "Box Hunt is a niche retailer that has a special place in the hearts of collectors. They specialize in blind boxes—pick one and a limited edition collectible could be yours! Besides all sorts of blind box editions, Box Hunt also has vinyl toys and figurines for any fandom. Try getting a blind box or two, but be warned: it is addictive!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo14Sep202211144121Oct2022103933.jpg"
  },
  {
    "name": "Brands Outlet",
    "unit": "LG-041",
    "desc": "Brands Outlet is an one-stop shop for the hottest fashion trends for all ages! The relaxed, sprawling space is home to racks of stylish apparel for men and women, boys and girls. You can shop for tops, trousers, dresses and accessories right here, all at affordable prices! It’s without a doubt that everyone outfits will look better than ever with a trip to Brands Outlet.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019163431.jpg"
  },
  {
    "name": "Chateraise",
    "unit": "LG-019",
    "desc": "Being popular locally in Japan with its 580 outlets while opening more than 90 outlets worldwide, Chateraise produces scrumptious desserts with its high quality, healthy ingredients in collaboration with Japanese farmers. Chateraise is known for its diversified cakes, chilled desserts, fruit jellies and selected chocolates amongst its customers. Chateraise also offers choices of gift boxes for you to share delicious mixtures of Japanese confectionery with your loved ones.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile08Jun2022112751.jpg"
  },
  {
    "name": "Din by Din Tai Fung",
    "unit": "LG-005&006",
    "desc": "Fun fact: did you know that Din Tai Fung began its culinary journey selling cooking oil in 1958? Market and consumption trend changes saw the company transform into the restaurant of the iconic Xiao Long Bao (Steamed Dumpling) in 1972. It has since garnered a Michelin star and is the only Asian restaurant on the World’s Top Ten Best Restaurants list by The New York Times. Diners flock here for the exceptionally fine dimsum and Shanghainese cuisine.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170409.jpg"
  },
  {
    "name": "Dragon-i",
    "unit": "LG-056",
    "desc": "Dragon-i prides itself in serving mouthwatering Shanghainese cuisine, prepared by skilful chefs from Shanghai, Lanzhou and Hong Kong. Customers return often for the piping-hot Xiao Long Bao dumplings and springy La Mian noodles, of which they are best known for. Don’t miss the other menu items, however! All taste equally delicious, as the ingredients and condiments are brought in fresh for authenticity. Add this into the combination of warm service and lively environment, and you have yourself an unmatched culinary experience for a family feast!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/dragon i mobile06May2025172813.jpg"
  },
  {
    "name": "Dubu Yo (Urban Korean Food)",
    "unit": "LG-003",
    "desc": "Indulge in the K-culture wave at DubuYo, where urban Korean food is served in a hip atmosphere! Best known for their signature Soondubu Jjigae (Spicy Tofu Stew), DubuYo also serves Korean delights such as Bibimbap (Korean Rice Bowl), Tteok-bokki (Rice Cake), and spicy chicken wings! Look out for their seasonal items as well, where unconventional flavours meld together in surprising new ways.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019172230.jpg"
  },
  {
    "name": "DUNKIN'",
    "unit": "LGK-21",
    "desc": "Treat yourself to donuts and coffee at Dunkin’! Made fresh daily, this baked goods and coffee chain boasts a deliciously wide variety of donuts and great-tasting beverages that are simply irresistible. Satisfy your craving for something sweet and filling and pair it with delightfully smooth and bold Dunkin’ coffee. Don’t forget to try something from their seasonal donuts menu and, for the tea lovers, take a sip of Dunkin’s take on the local favourite teh tarik!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile19Apr2023111447.jpg"
  },
  {
    "name": "Eggette Lab",
    "unit": "LGK-20",
    "desc": "Indulge in a little treat from Egggette Lab! Eggette Lab serves up Hong Kong’s no. 1 street snack – the Eggette waffle. Also known as Gei Dan Jai, this spherical egg-based waffle is chewy on the inside and crispy on the outside. Delight in the original sweet Eggette for that authentic Eggette flavour, or get the tricolour Eggette made of original, chocolate, and charcoal flavours!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Eggette Lab- mobile logo21Oct2023003234.png"
  },
  {
    "name": "Elianto Make Up",
    "unit": "LGK-02",
    "desc": "Everyone deserves to look their best. If you love exploring different beauty looks and indulging in the latest innovative skincare, elianto’s treasure trove of affordable and quality products will present you with a whole new world of beautiful possibilities.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo01Apr202111200202Nov2021125920.jpg"
  },
  {
    "name": "Empire Sushi",
    "unit": "LGK-15",
    "desc": "Empire Sushi brings you the best of traditional Japanese sushi tailored to the local palate. The sushi here is loved by locals for its freshness and high-quality ingredients. To make the experience unique, Empire Sushi utilises local spices for their in-house sauce and explores a variety of culinary styles that delight! All your favourite sushi are prepared fresh daily with a grab-and-go concept in mind, so stop by and pick them up anytime you fancy.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile11Nov2022103924.jpg"
  },
  {
    "name": "Eu Yan Sang",
    "unit": "LG-059",
    "desc": "Eu Yan Sang is renowned in the Chinese medicinal market for its stock of fine quality Chinese herbs, Chinese Proprietary Medicines, health foods and supplements. The specialist stocks over 300 house brand products in-store, as well as over 1000 Chinese herbs and medicinal products from various ailments! Get all your TCM needs right here at Eu Yan Sang––you will not be disappointed.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019172302.jpg"
  },
  {
    "name": "Eureka Snack Bar",
    "unit": "LGK-14",
    "desc": "Lowest of calories, unparalleled crunch; only in popcorn do we find that perfect munch—And when it comes to the fine art of popped corn, nobody does it like Eureka Snack Bar! Though it found a beginning in an unintentional moment of stumbled-into perfection (that made them go “Eureka!”), it is in their uncompromising emphasis on redefining what “Snack Time” meant as an experience, plus a genuine love for that life-changing bite that shines through undeniably in their every offering, that they find that special something which keeps them miles ahead of their competition...as the true Snack Time Masterminds.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile07May2021132507.jpg"
  },
  {
    "name": "F.O.S",
    "unit": "LG-038",
    "desc": "For all wardrobe staples, look no further than F.O.S. The retail chain is well established as a go-to for affordable, quality apparel. You’ll find styles for the whole family, from basic tees to business shirts, kiddy clothing and footwear. It’s everything you need and more, right here at F.O.S.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019180217.jpg"
  },
  {
    "name": "FamilyMart",
    "unit": "LG-020",
    "desc": "Experience a true masterpiece of Japanese urban culture: the konbini! FamilyMart is the epitome of convenience, providing all type of necessities to keep you going on a busy day. Pay your bills or send parcels right at the store. If you’re feeling hungry, there is a startling array of snacks and ready meals to choose from, all delivered daily for the ultimate freshness.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019171734.jpg"
  },
  {
    "name": "Famous Amos",
    "unit": "LGK-06",
    "desc": "“Free Smell\" from our Hot-baked store has been an irresistible aroma of our freshly baked cookies recognized by every true cookie lover anywhere. There are nine varieties of chocolate chip cookies, freshly baked throughout the day using the best ingredients, like semi-sweet chocolate chips and flavorful nuts. That is what made these homemade tasting cookies famous! At Famous Amos, we also have Soft & Chewy Cookies, Muffins, Brownies, Chocolate and other customizable gift hampers.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019162127.jpg"
  },
  {
    "name": "FIX Aquatics",
    "unit": "P1 North",
    "desc": "Dive into the aquatic world of aquariums, paludariums, and underwater ecosystems! FIX Aquatics is passionate about displaying the beauty of underwater life. Whether you’re into freshwater critters and aquatic flora or saltwater dwellers and cultured corals, they have top-notch equipment and expert advice to keep your tanks healthy and thriving. Make a trip to FIX Aquatics, where master aquarists and aquatic enthusiasts are welcome to enjoy their aqua-tastic hobby!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/aqatics mobile03Oct2024174919.jpg"
  },
  {
    "name": "FIX IT ALL Auto Detailing",
    "unit": "P1 North",
    "desc": "Your car would look better than ever with FIX IT ALL Auto Detailing! It’s a one stop service that provides car washing, polishing and detailing. With more than 10 years experience in the industry, you can be sure that your car is in good hands. FIX IT ALL Auto Detailing also prides itself on assessing the service needs of customers and giving great solutions, rather than just providing a service. This keeps customers’ coming back and their cars clean and polished.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile29Jul2020192042.jpg"
  },
  {
    "name": "FIX IT ALL Auto Detailing (South)",
    "unit": "P1 South",
    "desc": "Your car would look better than ever with FIX IT ALL Auto Detailing! It’s a one stop service that provides car washing, polishing and detailing. With more than 10 years experience in the industry, you can be sure that your car is in good hands. FIX IT ALL Auto Detailing also prides itself on assessing the service needs of customers and giving great solutions, rather than just providing a service. This keeps customers’ coming back and their cars clean and polished.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile29Jul2020192042.jpg"
  },
  {
    "name": "Fix Shoe Spa",
    "unit": "NPK-01",
    "desc": "Bring your sneakers back to life at Fix Shoe Spa! This professional shoe care service offers premium shoe laundry and restoration services, including Standard Wash, Detail Wash, and Midsole Unyellowing. Using gentle, effective methods to give your daily wear and prized collections a total refresh, your kicks will look almost as good as new! Drop off your favourite pair for a quick spa day today!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/she spa mobile02May2025143733.jpg"
  },
  {
    "name": "FUIYOH! It's UNCLE ROGER",
    "unit": "LG-055",
    "desc": "FUIYOH! it’s UNCLE ROGER serves up a fun dining experience of Asian cuisine, with a special spotlight on fried rice! Every plate of UNCLE ROGER-approved fried rice makes a great base for a little extra fuiyoh – we’re talking grilled unagi, satay daging, MSG Kale Chips, and the like! Even better, upgrade your meal to the next level with some YSoWeak Mala Popcorn Chicken and Mala Okra Fries to share with the table, then finish off with brain-freezing fruit slushies and creamy soft-serve ice cream. Before you leave, remember the UNCLE ROGER experience with a souvenir from the merchandise corner. Don’t wait anymore – come for the food, stay for the fun! FUIYOH!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/UR Mobile24Feb2025123315.jpg"
  },
  {
    "name": "Garmin",
    "unit": "LGK-10",
    "desc": "Coming from a long history of innovative tech, Garmin now has an impressive range of wearable devices for any lifestyle! From marine or automotive to fitness and outdoor recreative, there is a Garmin device for you. Each smart watch, activity tracker, GPS device is beautifully designed and packed with cutting-edge features so that you can beat yesterday, every day.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019162301.jpg"
  },
  {
    "name": "Garrett Popcorn Shops",
    "unit": "LGK-23&24",
    "desc": "For over seven decades, Garrett Popcorn Shops has served gourmet popcorn using wholesome ingredients in their secret family recipes, passed down for generations. Custom grown, non-GMO butterfly and mushroom kernels are first hot-air popped in their kitchens, then enriched with flavor in seasoned, old-fashioned Copper Kettles. Because good things take time, Garrett Popcorn is handcrafted in small batches throughout the day.\n\nSignature recipes include the fan-invented, original Chicago-style popcorn, Chicago Mix™, which blends the sweetness of CaramelCrisp™ with the savory goodness of CheeseCorn; plus Buttery (a vegan treat!), Plain, CheeseCorn, CaramelCrisp, Almond CaramelCrisp and Macadamia CaramelCrisp.\n\nLike no other™, Garrett Popcorn enchants adoring fans around the world.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile21Apr2023105226.jpg"
  },
  {
    "name": "Good2U Concept Store",
    "unit": "LG-028",
    "desc": "Good2U is inspired by everyday comfort for all. Our extensive collection of comfortable, stylish, and affordable garments are designed to provide you with maximum value. Good2U is more than just clothing, it's an experience. Our focus on quality and versatility allows us to create long-lasting wardrobe staples that empowers you to express your own individual style with ease.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LATEST G2U LOGO24Jun2025101008.jpg"
  },
  {
    "name": "Guardian",
    "unit": "LG-022&023",
    "desc": "Guardian is a one-stop chain for everyone’s lifestyle needs, providing an extensive range of health, beauty and personal care products. The brand is well known for great quality and affordability, with household brands and well-loved products stocked on the many shelves here!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019172038.jpg"
  },
  {
    "name": "Habib",
    "unit": "LG-029",
    "desc": "For the finer things in life, drop by HABIB, Malaysia’s premier jeweller. Be dazzled by the beauty and intricate craftmanship in each and every piece of gold, diamond and coloured gemstone jewellery, ranging from trendy contemporary pieces to timeless classics.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile12Jul2022160738.jpg"
  },
  {
    "name": "Harvey Norman",
    "unit": "LG-014&015",
    "desc": "Appliances, gadgets, furnishing and so much more are available at Harvey Norman, an Australian superstore for your lifestyle needs. Home to some of the biggest brands in household and IT products, shopping is made easy with Harvey Norman’s selection of brands, competitive prices and superb after sales services. Come right in, and shop with confidence of quality and delivery right here.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019172929.jpg"
  },
  {
    "name": "Hazukido",
    "unit": "LGK-01",
    "desc": "Hazukido brings to you the incredible taste of pastries that no one can resist! Treat yourself to the best croissant chain in all of Asia! Be the first to try out this French pastry made with a unique Japanese folding technique. Each croissant is made with premium ingredients around the world, making it a gastronomic event for all to enjoy.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo26Jan202120404814Dec2021155951.jpg"
  },
  {
    "name": "Herbal Farmer",
    "unit": "LG-042",
    "desc": "A first of its kind, Herbal Farmer caters to Malaysian urbanites who see Chinese herbal alternatives. This modern herbal store offers high quality Chinese remedies in a friendly, self-service environment. The traditional envelope has truly been pushed, as proven by the clean environment full of eye-catching products!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019180451.jpg"
  },
  {
    "name": "Horti Plant",
    "unit": "P2 Centre",
    "desc": "Breathe life into any space with pieces of art crafted by nature! Horti Plant has beautifully assembled terrariums that can elevate any surface, gorgeous kokedamas that hang gracefully in the air, dragon fruit seedlings in cute pots, and magnificent preserved moss art that can transform any wall. This artistic plant store also offers terrarium workshops for beginners, ideal for those who want to try designing their own pocket garden. Explore a world of creativity rooted in nature here!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/horti mobile27Aug2024140312.jpg"
  },
  {
    "name": "innisfree",
    "unit": "LG-057",
    "desc": "innisfree is a natural cosmetics brand that shares the benefits of nature from the pristine island of Jeju, allowing for vibrant beauty and pursues an Eco-friendly green life to preserve the balance of nature.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile01Jun2023201206.jpg"
  },
  {
    "name": "Juice Works",
    "unit": "LGK-11",
    "desc": "Your favorite fruit factory is here! Get excited over 30 flavors of juices to choose from or get creative by coming up with your very own unique combination. Committed to creating hand-made fruit juices and smoothies from the freshest of ingredients that are carefully sourced, we are on a quest to satisfy your yearning for healthy and delicious eats anywhere, anyday.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019162631.jpg"
  },
  {
    "name": "Jungle House",
    "unit": "LG-017",
    "desc": "From hive to home! Jungle House delivers ethically sourced honey that’s bold in flavour, rich in nutrients, and naturally pure. By working hand-in-hand with native beekeepers, Jungle House helps protect the fragile ecosystem of honeybees — essential for sustainably harvesting 100% pure, natural, raw honey. Visit the Jungle House flagship store to discover more about nature’s greatest gift: honey.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/JH Mobile21May2025155017.jpg"
  },
  {
    "name": "Kedai Kopitiam Oriental Kopi",
    "unit": "LGK-03A",
    "desc": "Retaining that essential quality that defines NanYang cuisine, Oriental Kopi utilises traditional techniques to specially craft each and every one of its offerings, elevating its servings beyond comparison. Oriental NanYang Coffee, Portuguese Egg Tarts, Polo Buns, Traditional Toast, Signature Nasi Lemak and so much more. Excited? You should be… For the true wonders of the Orient are now yours to experience.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile25Feb2021172117.jpg"
  },
  {
    "name": "Kedai Kopitiam Oriental Kopi",
    "unit": "LG-061",
    "desc": "Retaining that essential quality that defines NanYang cuisine, Oriental Kopi utilises traditional techniques to specially craft each and every one of its offerings, elevating its servings beyond comparison. Oriental NanYang Coffee, Portuguese Egg Tarts, Polo Buns, Traditional Toast, Signature Nasi Lemak and so much more. Excited? You should be… For the true wonders of the Orient are now yours to experience.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile25Feb2021172117.jpg"
  },
  {
    "name": "KFC",
    "unit": "LG-009",
    "desc": "It’s hard to beat decades of memories and great food! Enjoy that and more at KFC, Malaysian’s go-to restaurant for ‘Finger Lickin’ Good’ moments. It all starts with chicken offerings of Original Recipe or Hot & Spicy, followed by innovative menu items, festive promos then topped with excellent service! At KFC, you’ll enjoy the best of Southern fried chicken that has developed a distinctive local personality––what could possibly be better?",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019180729.jpg"
  },
  {
    "name": "KKV",
    "unit": "LG-018",
    "desc": "KKV offers a curated range of trendy lifestyle products, from snacks and beauty items to stationery and homeware. Known for its vibrant displays and unique finds, it provides a fun shopping experience for all ages. Perfect for quick treats or gifts, KKV is your go-to for everyday delights",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/KKV Mobile19Jun2025091744.jpg"
  },
  {
    "name": "Koong Woh Tong",
    "unit": "LG-050&050A",
    "desc": "From its best-selling herbal jelly to traditional Chinese herbal teas, Koong Woh Tong’s line of herbal products is well-known for its remarkable healing properties. Experience in-store the soothing effects of a bowl of ‘Wu Hua Cha’ (五花茶) or ‘Ya Sei Mei’ (廿四味) and bring home its conscientious selection of traditional herbal teas to drink anytime.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile31Oct2022094250.jpg"
  },
  {
    "name": "Krispy Kreme",
    "unit": "LGK-27",
    "desc": "Enjoy fresh, fluffy doughnuts from Krispy Kreme! Delivering joy since 1937, this world-famous doughnut franchise makes doughnuts so awesome, you’ll always come back for more. Its signature Original Glaze is a crowd-favourite classic that melts in your mouth with sweet sugary goodness and fluffy-as-clouds texture. Whether you’re looking for a midday pick-me-up or sharing the joy with friends, Krispy Kreme has treats that are both sweet and magical for everyone!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/KK Mobile13Aug2025175345.jpg"
  },
  {
    "name": "Kwan Kee Store",
    "unit": "LGK-12",
    "desc": "Delight in traditional Chinese pastries from Kwan Kee Store! Every pastry is meticulously crafted using freshly milled rice that is made using time-honoured methods of grinding rice flour. By combining traditionally milled rice flour and age-old recipes, Kwan Kee Store preserves the authenticity and exceptional flavour of its traditional desserts. Enjoy the delicate texture of a Rice Bowl Cake, the nutty flavour of Steamed Black Sesame Layer Cake, the slightly tangy taste of White Sugar Cake, the gently sweet flavour of Steamed Red Bean Cake, and more!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Kwan Kee Mobile29Jul2025143840.jpg"
  },
  {
    "name": "KyoChon 1991",
    "unit": "LG-048",
    "desc": "With several awards under their belt, KyoChon 1991 certainly knows a thing or two about delicious South Korean fried chicken! Step into the restaurant for a fried chicken experience that showcases a wide spectrum of flavours, going far beyond the regular offerings. Choose from series such as Original, Red Pepper, Honey, Salsal and Rice––each accentuating the natural flavour of fried chicken. The relaxed environment is perfect for impromptu gatherings with family friends, so just get in line and enjoy the crunch!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile09Apr2019095640.jpg"
  },
  {
    "name": "LAC",
    "unit": "LG-040",
    "desc": "Welcome to the largest global specialty retailer of health food – your trusted source for nutritional and fitness supplements for over 75 years. LAC know what they’re talking about when it comes to quality products, standards, responsible labeling, ingredient safety and products that work. Their special in-house brand is manufactured in a facility that’s GMP-compliant, FDA-registered, TGA-certified (Australia) and completely state-of-the-art. Every product undergoes 150 quality and safety checks – even exceeding FDA and Malaysian regulations. That’s how far they’ll go in their commitment to quality – upon purchase and afterwards. At LAC, the qualified nutritionists and advisors want you to live your best life. So let them know what you’re looking for, and they’ll suggest some great supplements to give you a healthy edge.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/LAC WEBSITE10Oct2024155552.jpg"
  },
  {
    "name": "Lavender",
    "unit": "LG-031",
    "desc": "Follow the scent of freshly baked bread, and it will arrive at Lavender! The bakery is filled with racks of warm pastries, breads and other baked treats, with more coming out of the ovens daily. For the sweet tooth, an array of fresh cream cakes and sticky desserts will surely delight. Having combined traditional techniques, modern technology and skilled bakers, Lavender has certainly found the secret ingredient to creating delicious treats the whole family can enjoy!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019183022.jpg"
  },
  {
    "name": "Lazo Diamond",
    "unit": "LGK-25",
    "desc": "At Lazo Diamond “Owning a diamond is no longer a dream”. Modern, unique and contemporary designs delivered to you in the finest quality at the most affordable prices. No wonder Lazo Diamond is now Malaysia’s premier manufacturer and retailer of white gold and diamond jewellery. With not only excellent sales but also excellent after sales service, expect to be 100% satisfied.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/lazo_diamond_logo_mobile26Apr2024175148.jpg"
  },
  {
    "name": "Le Creuset",
    "unit": "LG-007",
    "desc": "Le Creuset has grown to offer products across a range of materials and categories, with a focus on \"the right material for the right job.\" In addition to their colorful enameled cast iron cookware today's product offerings include their range of premium stoneware cookware and bakeware proudcts, high performance tri-ply stainless steel and forged hard anodized cookware lines, teakettles, stockpots, and tools and wine accessories.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Le Creuset Mobile21May2025112055.jpg"
  },
  {
    "name": "llaollao",
    "unit": "LGK-09",
    "desc": "If ice-cream isn’t really your thing, give llao llao a try! Part of the worldwide frozen yoghurt phenomenon, llao llao is a firm favourite for their refreshing, creamy frozen yoghurt. Choose your preferred yoghurt size––mini treat or an extra-large sharing cup––then combine it with a choice of fresh seasonal fruits, crunchy cereals and yummy sauces. It’s a healthy alternative to all-day treating, so head on over to llao llao for yours!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019182911.jpg"
  },
  {
    "name": "Mahnaz Food",
    "unit": "LGK-19",
    "desc": "Mahnaz Food is all about healthy snacks and nutritious foodstuffs! With great fondness for yummy tidbits and nourishing food, Mahnaz Food is here to offer an assortment of delicious and nutritionally beneficial food products. Explore wholesome nibbles such as dates, dried fruits, nuts, and seeds, and find healthful ingredients like gum arabic, herbal extracts, oils, spices, all kinds of vinegar, and even fruit jams! Mahnaz Food imports most of its products from Islamic and Middle Eastern countries so come right in to discover some halal snacks!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile29Dec2022094002.jpg"
  },
  {
    "name": "Mak's Chee Authentic Wonton 麥氏西池港式雲吞麵",
    "unit": "LG-030",
    "desc": "Slurp up springy wonton noodles! Mak’s Chee Authentic Wonton dishes out fresh prawn wonton noodles using an age-old family recipe passed down for generations. Since its days as a small noodle stall in Guangzhou, China, in the 1920s, Mak’s Chee Authentic Wonton has attracted numerous patrons, including politicians, leaders, and celebrities. Come right in for a bowl of piping hot noodles and other dishes that are sure to delight!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Mak'sChee_Logo_Mobile22Aug2025180841.jpg"
  },
  {
    "name": "Meng Meng Roasted Duck",
    "unit": "LG-012 & 013",
    "desc": "Meng Meng Roasted Duck has been delighting customers with their traditional roasted meat dishes for over 16 years. Their humble, homely recipes are an endless source of comfort, made even more unique as the meats are cooked using charcoal for an added smoky dimension. The restaurant is a pleasure to sit in with its modern oriental interior, while friendly wait staff ensure you are served the best of roasted duck and pork dishes!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019173640.jpg"
  },
  {
    "name": "Miniso",
    "unit": "LG-028A",
    "desc": "Choose happiness every day! MINISO boasts trendy and creatively designed lifestyle products that are well-made, aesthetically pleasing, and extremely practical. Surround yourself with your favourite characters from exclusive brand partnerships, such as Harry Potter, Disney, Sanrio, Barbie, and Marvel. Not only that, you will find other functional, stylish, and sophisticated everyday goods at MINISO that bring joy to your everyday life. Visit MINISO today!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Miniso Mobile26Aug2025112813.jpg"
  },
  {
    "name": "mothercare",
    "unit": "LG-060",
    "desc": "Mothercare is the world’s largest and most trusted retail specialist in newborn and parenting products. The founder of Mothercare, Selim Zilkha envisioned a one-stop- shop for the needs of mother and baby under one roof. This vision continues today in Mothercare shops that offer a premium shopping experience, with full range of specialized, high quality, safe and innovative products and services. Mothercare takes great pride in providing products and the people to manage that wonderful, frustrating, hilarious, serious, exhausting and rewarding process call parenting.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Logo-mobile05Apr2019175948.jpg"
  },
  {
    "name": "MyIPOH 怡保",
    "unit": "LG-052",
    "desc": "Delight in Ipoh’s culinary gems! MyIPOH 怡保 serves up authentic Ipoh specialties made with grandma-approved recipes, using fresh, quality ingredients. Savour the real flavours of Ipoh and enjoy great vibes with family and friends at MyIPOH 怡保!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Myipoh Desktop07Nov202411105516Oct2025105203.jpg"
  },
  {
    "name": "myNews.com",
    "unit": "LG-044",
    "desc": "If you like snacking while you read, then myNews.com is what you’ll need for a quick fix! This convenience store stocks newspapers, magazines and even light novellas on one side, and yummy snacks and drinks on the other. Now everyone can enjoy the best of both worlds under one convenient roof",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019180620.jpg"
  },
  {
    "name": "Nando's",
    "unit": "LG-049",
    "desc": "Nando’s is much loved for its flaming flavours and Portuguese inspired Peri-Peri sauces. You’ve never tasted anything like their juicy chicken, flame-grilled in house! Every item on their menu is packed with flavours that complement one another, served fresh in a vibrant atmosphere. It’s always a feast for your senses at Nando’s, so experience it today.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019183637.jpg"
  },
  {
    "name": "Nyeon Nails",
    "unit": "SPK-01",
    "desc": "Slay your nail game all day, every day! Nyeon Nails has press-on nails for every occasion, from clean, nude tones to bold, intricate designs. Quick, easy, and reusable, Nyeon Studio press-on nails will have you looking put together effortlessly at the snap of your fingers. Switch up your style anytime, anywhere, with press-on nails that match every fit and every mood!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/nyeon mobile11Apr2025135602.jpg"
  },
  {
    "name": "Ogawa",
    "unit": "LG-058",
    "desc": "In times of exhaustion and tiredness, OGAWA is always here for everyone! This health and wellness brand has been caring for countless busy lives with their innovative equipment and home wellness solutions. From massage chairs to footbaths, their award-winning products have one aim in mind: to bring you relaxation when you need it most.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile25Jan2022161110.png"
  },
  {
    "name": "OldTown White Coffee",
    "unit": "LG-051",
    "desc": "Enjoy the taste of deliciously authentic Malaysian Cuisine! OldTown White Coffee brings you the timeless Ipoh coffee shop ambience and classic “kopitiam” comfort food to their menu. Relax and enjoy signature meals like Ipoh Chicken Hor Fun, Prawn Meehoon Mee and Nasi Lemak. You can also have a taste of the aromatically delightful Old Town White Coffee for a truly satisfying meal.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile08Aug2022115854.jpg"
  },
  {
    "name": "ParaThai",
    "unit": "LG-054",
    "desc": "Satisfy your cravings for rich and aromatic Thai cuisine! ParaThai serves up authentic Thai dishes crafted by an expert culinary team of Thai chefs, using ancient recipes with a focus on flavours and freshness. Explore its elaborate menu and be spoiled for choice, ideal for a casual family dinner or gathering with friends!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/Para Thai Mobile13Aug2025094039.jpg"
  },
  {
    "name": "Pho Vietz",
    "unit": "LG-053",
    "desc": "Delight in the aromatic and vibrant flavours of Vietnamese food! Pho Vietz serves up soul-satisfying Vietnamese food that is meticulously prepared, authentic in flavour, and made with fresh ingredients. Tease the palate with something light like Bánh Mì or Bánh Cuốn, then savour hearty meals like Phở and Bo Kho. Don’t forget to order a creamy and velvety cup of Vietnamese coffee while exploring the dessert menu. Visit Pho Vietz for an unforgettable culinary journey!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/PV Mobile23May2025104204.jpg"
  },
  {
    "name": "Pizza Hut",
    "unit": "LG-010&011",
    "desc": "If you’re at a loss on what to eat, bring your family and friends over to Pizza Hut! The much-loved pan pizza is always served hot, crisp and oh-so-cheesy, with mouthwatering toppings and seasonal options. You can also order delicious pastas and fun sides such as wings, wedges and bread twists. End your meal with a molten lava cake, and there you have it––another great experience only at Pizza Hut.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019183601.jpg"
  },
  {
    "name": "Poh Kong",
    "unit": "LG-026",
    "desc": "Founded in 1976, Poh Kong is now the largest jewellery retail chain in Malaysia. It offers a wide collection of gold ornaments, diamonds and gems which are lovingly crafted by its team of skilled craftsmen and designers. If you are looking for that very special piece for that very special someone, try our collection of Schoeffel luxury pearls from Germany, Luca Carati & Moraglione 1922 from Italy and many more exquisite jewelleries from around the world that is only available at Poh Kong.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019181617.jpg"
  },
  {
    "name": "Royce",
    "unit": "LGK-03",
    "desc": "Royce’ brings you an authentic taste of Hokkaido with fine, artisanal chocolates that are loved by many. The beauty of Royce’ is in the rich, creamy texture of each chocolate square. This is accentuated by the carefully sourced ingredients from all over the world, ensuring maximum flavour with every bite. If you are in need for an excellent gift, consider getting a lovely box of Royce’ to make your occasion special!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile16Aug2019113727.jpg"
  },
  {
    "name": "S.D.S SINCE 1987 Bakery Café",
    "unit": "LG-047",
    "desc": "SDS Bakery is loved by locals for its delicious pastries and sweet goodies. With 27 outlets in Johor and counting, the bakery-cum-cafe is constantly living up to it’s Share, Dine, Smile. Enjoy a mouthwatering selection of pastries, breads, cakes and gelatos made fresh daily. They even do caterings for events, so be sure to ask the friendly staff for ideas on your next big party!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019162756.jpg"
  },
  {
    "name": "Season Silver Trading",
    "unit": "LGK-13",
    "desc": "Inspired by the detailed couture and a mix of street styles, Season Silver focuses on creating the latest trend of jewellery pieces. Perfect to complete your day-to-night look with this must-have bling, you will be overindulged with choices. Implementing the core value of the brand, Season Silver offers impeccable customer service that holds on to “It’s about you, always”.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile16Mar2022085711.jpg"
  },
  {
    "name": "Secret Recipe",
    "unit": "LG-046",
    "desc": "Come together for good food, good company and good times at Secret Recipe Cakes & Café. Their much-loved fusion menu consists of award-winning dishes like Tom Yum Kung and Irish Lamb Shank, as well as favourites like Chicken Cordon Bleu, Spaghetti Meatballs and various Asian Wok Dishes. Of course, the spotlight remains on their fantastic array of cheese and cream cakes, guaranteed to send dessert lovers into seventh heaven!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019181828.jpg"
  },
  {
    "name": "Signature Market",
    "unit": "LG-039",
    "desc": "Embark on a healthy living journey with Signature Market! Whether you enjoy munching on healthy snacks like nuts, trail mixes, and dried fruits or have nutritious ready-to-eat meals, Signature Market has a range of carefully selected products dedicated to your well-being. Explore its ever-expanding wellness essentials, including snacks that are good for you to aromatherapy and skincare! Your wholesome lifestyle journey starts here with Signature Market and its sister brands:  Plant Origins, Yī, Two Tails, Bunny-U, and SingMaThai",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/SM Website27May2025110040.jpg"
  },
  {
    "name": "Smiggle",
    "unit": "LG-032",
    "desc": "Where a smile meets a giggle, SMIGGLE is the ultimate creator of fun and quirky desk companions! Bursting with flashy stationery, funky office supplies, wacky school bags, fancy lunchboxes, and spiffy drink bottles, there’s always something special for everyone. Step into the flamboyant world of SMIGGLE, where playful surprises await on every shelf.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/SmiggleLogo_Website23May2024145120.jpg"
  },
  {
    "name": "SMJ",
    "unit": "LG-013A & 013B",
    "desc": "If you are looking for a currency exchange provider that is alwaysavailable, reliable and offers the best prices, SMJ Teratai is the choice for you. One of the largest money-transfer and exchange service providers in Malaysia with over 80 outlets nationwide, we also offerinternational remittance service to more than 100 countries worldwide at competitive exchange rates and a low transfer fees. At SMJ, is that easy",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185402.jpg"
  },
  {
    "name": "Souper Tang",
    "unit": "LG-033",
    "desc": "Feel tired and drained from the demands of modern, contemporary lifestyle? Head on over to Souper Tang for a balanced, healthy and great tasting herbal-based meal that will heal, restore and rebalance your body. With a full range menu offering rice dishes, noodles, meats, desserts and of course soups, you are really spoilt for choice. So bring back instant vitality with a bowl now!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019181233.jpg"
  },
  {
    "name": "SUBWAY®",
    "unit": "LG-004",
    "desc": "Best-known for their foot long and 6-inch sandwiches, Subway freshly baked their bread to prepare you the tastiest sandwiches, filled with only the best ingredients. Hand-picked your choice of meat, vegetables, toppings with a little add-ons of cheese and well-made sauces. Other than sandwiches, Subway offers scrumptious delicacies such as wraps, delis, fresh salads, crispy potato chips and yummy daily baked cookies! Make sure to add on thirst-quenching drinks when you purchase Subway combo.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile11Oct2022095509.jpg"
  },
  {
    "name": "Tao Yuan",
    "unit": "LG-016",
    "desc": "Tao Yuan is your one stop shop for all things local. Need a thoughtful gift? A trip back in time? Just head here and pick up some traditional tidbits, snacks and food products from Tao Yuan’s well-stocked shelves!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019173609.jpg"
  },
  {
    "name": "Tealive",
    "unit": "LGK-05",
    "desc": "Tealive is known among Malaysians as the go-to place for flavoured bubble tea. With a refreshing menu of over 60 beverage choices, you can enjoy everything from signature milk teas and coffees to smoothies and matcha. Each drink is brewed with the best ingredients and served by the friendliest staff for the ultimate tea sipping experience. Tealive is all about promoting modern tea culture, hence the passion for quality products and service. Not a fan of tea? Order one at Tealive and get ready to change your mind!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019181929.jpg"
  },
  {
    "name": "Texas Chicken",
    "unit": "LG-034",
    "desc": "For full, Southern-styled fare, look no further than Texas Chicken! The Texas-born restaurant has been serving flavourful fried chicken since 1952. That’s not all they specialise in; find menu items such as crispy tender strips, burgers, wraps, side dishes and not to be missed, honey-butter biscuits baked from scratch!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019170222.jpg"
  },
  {
    "name": "ThaiExpress",
    "unit": "LG-021",
    "desc": "Home of Thai delicacies, the heat is always turned on at ThaiExpress! Food lovers flock to this restaurant for the dishes packed with a medley of spices and served with a modern twist. Thai favourites not to be missed include savoury Pad Thai, tangy Seafood Tom Yum soup and fragrant Pad Kaprao Gai. Feel free to dine in a large crowd or enjoy a satisfying meal for one, as ThaiExpress offers portions for sharing or individual dining. Ready for a feast full of flavour? Grab a table and get ready to order!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019163729.jpg"
  },
  {
    "name": "The Chicken Rice Shop",
    "unit": "LG-024",
    "desc": "The Chicken Rice Shop has been serving traditional Hainanese chicken rice for years, and is now a favourite staple to many. You won’t just get a perfect plate of fluffy rice and flavourful chicken- the brand stays true to their motto of ‘Chicken Rice...and More’ by offering a yummy menu of steamed, roasted, honey barbecued and soy sauce chicken, as well as more than 25 other dishes such as Hainanese Curry Chicken, Special Penang Chai Boay (Spicy Mixed Vegetables) and Penang Rojak. Every dish is lovingly prepared and made fresh in-house for maximum flavour and enjoyment.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019184326.jpg"
  },
  {
    "name": "The Founders Bakery",
    "unit": "LGK-26",
    "desc": "One word – bagels. But not just any bagel! The bagels at The FOUNDERS BAKERY are brought to you exclusively by The FOUNDERS Cafe, a spot frequented by world-famous superstars Jay Chou, Hujan Noh Salleh, and many others, just to name a few! At The FOUNDERS BAKERY, it’s all about that #GOOD bagel life. Come on over to taste some deliciously good bagels!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/THE FOUNDERS BAKERY Mobile-0322Dec2023120052.jpg"
  },
  {
    "name": "TheFaceShop",
    "unit": "LG-001",
    "desc": "Science meets nature in this delightful beauty and skincare shop, with great products to pamper your skin, as well as lotions and potions for your hair and body, too.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019175738.jpg"
  },
  {
    "name": "Udders",
    "unit": "LGK-22",
    "desc": "Udders is a gutsy ice cream shop serving mad tasty ice cream with a big scoop of fun! With a wacky love for ice cream and heaps of bizzaro humour, this cheeky ice cream brand is all about creating mouthwatering flavours anyone can enjoy. Take a bite of their Mao Shan Wang ice cream approved by durian lovers everywhere, or try one of their liqueur ice creams for something bold! Don’t forget to pack home a pint of good old Cookies & Cream to share with everyone you love.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile09Apr2023214210.jpg"
  },
  {
    "name": "VANZO",
    "unit": "LGK-17",
    "desc": "Many of us enjoy a scent-sational ride, but it’s important to find the right air freshener for you. VANZO has teamed up with leading Japanese fragrance companies to formulate air fresheners that not only smell great, but are free from harmful chemicals, too! With VANZO’s range of air-fresheners, you can enjoy long-lasting floral, vanilla, or velvety musk scents in your vehicle. Take a look at their range of accessories as each product is carefully made to suit your individual needs. There’s bound to be something here for you!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/vanzo mobile05Dec2024110029.jpg"
  },
  {
    "name": "VERRONA HILLS",
    "unit": "LG-061A",
    "desc": "Verrona Hills delights with artisanal bread, pastries, and cakes, made from premium French-imported ingredients. Indulge in their freshly baked daily creations for a truly enchanting pâtisserie experience.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/VH Mobile26May2025142650.jpg"
  },
  {
    "name": "Village Grocer",
    "unit": "AT-2",
    "desc": "Everyone favourite neighbourhood supermarket is here! Village Grocer takes pride in providing fresh produce everyday at their stores. Asides from that, they also offer fine quality goods across a range of departments, as well as an enjoyable shopping experience for all.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185126.jpg"
  },
  {
    "name": "Watsons",
    "unit": "LG-036&037",
    "desc": "“Look good, feel great” in the world of Watson. With thousands of stores around Asia and Europe, the world of Watson has expanded to become Asia’s leading health and beauty retailer AND the No. 1 pharmacy brand in Asia. Find anything from skincare, cosmetics, beauty and healthcare products to pharmaceutical drugs right here, with personalized advice and counseling in health, beauty and personal care tailored to your very needs.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185443.jpg"
  },
  {
    "name": "Whoosh Eyewear",
    "unit": "LG-002",
    "desc": "Whoosh Eyewear embodies quick and fashionable eyewear for trendsetters who value speedy style and quality. The relaxed, open atmosphere welcomes you to browse ranges in 3 distinctive styles. Once you’ve selected your frames, you can choose from 4 fixed affordable price packages, have your eyesight tested by professional opticians, and your new glasses are ready! Looking good has never been so effortless, so get yours today!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile05Apr2019185524.jpg"
  },
  {
    "name": "ZUS Coffee",
    "unit": "LGK-16",
    "desc": "Get your daily caffeine fix right here at ZUS Coffee! Using quality Arabica beans and top-notch brewing technology, ZUS Coffee delivers some of the best hand-crafted specialty coffee at a great price. Explore their unique signature menu (which includes the mysterious ZUS Gula Melaka and Zirty Latté) or get a good old cup of espresso all at the same place.",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile30Mar2023093309.jpg"
  },
  {
    "name": "小管家 Fix It All (South)",
    "unit": "SP1-01",
    "desc": "Fix It All is a multi-talent service provider aimed to simplify your life. Services offered here include property management, fit-out consultancy, property, alteration, courier and printing services. They are constantly expanding their repertoire, so expect shoe & bag services to be added very soon! The brand’s aim to be accessible to all truly makes them everyone’s house keeper––some might say life-saver, too!",
    "logoUrl": "https://www.midvalleysouthkey.com/img/tenant/logo-mobile02Aug2019215938.jpg"
  }
]